Repository: vitrud/wols
Catalog: modules/aggregator/translations/modules-aggregator.*.po
Languages: ru

source: URL:
ru: УРЛ:

source: Updated:
ru: Обновлено:

source: Feed overview
ru: Информация о лентах

source: Items
ru: Пункты

source: Last update
ru: Обновлено

source: Next update
ru: Обновление

source: %time left
ru: через %time

source: remove items
ru: удалить пункты

source: update items
ru: обновить пункты

source: Category overview
ru: Информация о категориях

source: The name of the feed (or the name of the website providing the feed).
ru: Введите название ленты (обычно используют название сайта, с которого берётся лента).

source: The fully-qualified URL of the feed.
ru: Введите полный адрес ленты.

source: Update interval
ru: Интервал

source: Categorize news items
ru: Категория

source: New feed items are automatically filed in the checked categories.
ru: Пункты этой ленты будут автоматически добавляться в выбранную категорию.

source: The feed %feed has been updated.
ru: Лента «%feed» обновлена.

source: The feed %feed has been deleted.
ru: Лента «%feed» удалена.

source: The feed %feed has been added.
ru: Лента %feed добавлена.

source: Are you sure you want to remove all items from the feed %feed?
ru: Удаление пунктов ленты «%feed»

source: Discard items older than
ru: Хранение данных

source: checkboxes
ru: флажки

source: multiple selector
ru: мультивыбор

source: The category %category has been updated.
ru: Категория «%category» обновлена.

source: The category %category has been deleted.
ru: Категория «%category» удалена.

source: The category %category has been added.
ru: Категория «%category» добавлена.

source: Feed %feed deleted.
ru: Лента %feed удалена.

source: Feed %feed added.
ru: Лента %feed добавлена.

source: Category %category deleted.
ru: Категория «%category» удалена.

source: Category %category added.
ru: Категория «%category» добавлена.

source: Save categories
ru: Сохранить

source: The categories have been saved.
ru: Категории сохранены.

source: %ago ago
ru: %ago назад

source: read more
ru: далее...

source: %age old
ru: %age назад

source: !title feed
ru: Лента !title

source: Thousands of sites (particularly news sites and blogs) publish their latest headlines and posts in feeds, using a number of standardized XML-based formats. Formats supported by the aggregator include <a href="@rss">RSS</a>, <a href="@rdf">RDF</a>, and <a href="@atom">Atom</a>.
ru: Многие сайты публикуют своё содержание используя различные <a href="http://ru.wikipedia.org/wiki/XML">XML</a>-форматы. Модуль <a href="http://content-management-systems.info/drupal/project/aggregator">Aggregator</a> позволяет собирать с других сайтов ленты в форматах <a href="http://ru.wikipedia.org/wiki/RSS">РСС</a>, <a href="http://ru.wikipedia.org/wiki/RDF">РДФ</a> и <a href="http://ru.wikipedia.org/wiki/Atom">Атом</a>.

source: Current feeds are listed below, and <a href="@addfeed">new feeds may be added</a>. For each feed or feed category, the <em>latest items</em> block may be enabled at the <a href="@block">blocks administration page</a>.
ru: Ниже находится список лент, которые собираются вашим сайтом. Вы можете вывести каждую ленту или группу лент (категорию) в нужном регионе, сделав необходимые настройки на <a href="@block">странице блоков</a>.

source: Add a feed in RSS, RDF or Atom format. A feed may only have one entry.
ru: На этой странице вы можете добавить ленту в формате <a href="http://ru.wikipedia.org/wiki/RSS">РСС</a>, <a href="http://ru.wikipedia.org/wiki/RDF">РДФ</a> или <a href="http://ru.wikipedia.org/wiki/Atom">Атом</a>.

source: Categories allow feed items from different feeds to be grouped together. For example, several sport-related feeds may belong to a category named <em>Sports</em>. Feed items may be grouped automatically (by selecting a category when creating or editing a feed) or manually (via the <em>Categorize</em> page available from feed item listings). Each category provides its own feed page and block.
ru: Категории позволяют группировать вывод информации из разных лент в один раздел. Например, несколько лент спортивной тематики вы можете объединить в категорию «Спорт». Пункты лент группируются автоматически в зависимости от настроек самой ленты, но вы можете переносить отдельные пункты между лентами самостоятельно. Для каждой категории Друпал автоматически формирует свою страницу и блок.

source: !title category latest items
ru: Категория !title

source: !title feed latest items
ru: Лента «!title»

source: Number of news items in block
ru: Количество пунктов в блоке

source: The news items from %site have been removed.
ru: Пункты ленты %site удалены.

source: There is no new syndicated content from %site.
ru: Лента %site не содержит новых пунктов.

source: There is new syndicated content from %site.
ru: Получены новые пункты ленты %site.

source: The feed from %site seems to be broken, because of error "%error".
ru: Лента %site возможно повреждена, так как получен ответ %error.

source: The feed from %site seems to be broken, because of error "%error" on line %line.
ru: Лента %site возможно повреждена, так как получен ответ %error в строке %line.

source: The feed from %site seems to be broken, due to "%error".
ru: Лента %site возможно повреждена, так как получен ответ %error.

source: The feed from %site seems to be broken, due to an error "%error" on line %line.
ru: Лента %site возможно повреждена, так как получен ответ %error в строке %line.

source: Feed aggregator
ru: Ленты новостей

source: Configure which content your site aggregates from other sites, how often it polls them, and how they're categorized.
ru: Настройка сбора новостных лент с других сайтов, частоты их обновления и других параметров.

source: Add feed
ru: Добавить ленту

source: Update items
ru: Обновить пункты

source: Sources
ru: Источники

source: Edit feed
ru: Правка ленты

source: Edit category
ru: Правка категории

source: No feeds available. <a href="@link">Add feed</a>.
ru: Лент нет.

source: No categories available. <a href="@link">Add category</a>.
ru: Категорий нет.

source: The length of time between feed updates. Requires a correctly configured <a href="@cron">cron maintenance task</a>.
ru: Время между обновлениями. Обновление лент происходит при <a href="@cron">запуске cron</a>.

source: News items in block
ru: Количество пунктов в блоке

source: A feed named %feed already exists. Enter a unique title.
ru: Лента с заголовком «%feed» уже существует.

source: A feed with this URL %url already exists. Enter a unique URL.
ru: Лента с адресом %url уже существует.

source: OPML File
ru: Файл

source: OPML Remote URL
ru: Удалённый УРЛ ОПМЛ

source: This URL is not valid.
ru: Адрес введён неверно.

source: No new feed has been added.
ru: Новые ленты не добавлены.

source: The URL %url is invalid.
ru: Адрес %url введён неверно.

source: A feed named %title already exists.
ru: Лента с заголовком «%title» уже существует.

source: A feed with the URL %url already exists.
ru: Лента с адресом %url уже существует.

source: A space-separated list of HTML tags allowed in the content of feed items. Disallowed tags are stripped from the content.
ru: Введите список ХТМЛ-тегов, которые будут разрешены в получаемых сайтом лентах. Теги, которых нет в списке разрешённых, будут удалены.

source: Fetcher
ru: Получатель

source: Parser
ru: Парсер

source: Processors
ru: Исполнитель

source: Basic configuration
ru: Основные параметры

source: Default fetcher
ru: Стандартный получатель

source: Default parser
ru: Стандартный парсер

source: Default processor
ru: Стандартный исполнитель

source: Number of items shown in listing pages
ru: Пункты на странице

source: Requires a correctly configured <a href="@cron">cron maintenance task</a>.
ru: Обновление происходит при <a href="@cron">запуске cron</a>.

source: Select categories using
ru: Выбор категорий

source: For a small number of categories, checkboxes are easier to use, while a multiple selector works well with large numbers of categories.
ru: Тип переключателя, при выборе категории для пункта ленты. При использовании большого количества категорий удобнее использовать мультивыбор.

source: Length of trimmed description
ru: Размер краткого содержания

source: The maximum number of characters used in the trimmed version of content.
ru: Выберите количество знаков, которое будет содержаться в краткой версии документа. Отметьте: это значение будет применяться только к новым или обновлённым документам.

source: The Aggregator module is an on-site syndicator and news reader that gathers and displays fresh content from RSS-, RDF-, and Atom-based feeds made available across the web. Thousands of sites (particularly news sites and blogs) publish their latest headlines in feeds, using a number of standardized XML-based formats. For more information, see the online handbook entry for <a href="@aggregator-module">Aggregator module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/aggregator">Aggregator</a> позволяет собирать содержание с новостных лент других сайтов и публиковать полученные данные. Поддерживаются ленты форматов РСС, РДФ и Атом.

source: Viewing feeds
ru: Публикация лент

source: Feeds contain published content, and may be grouped in categories, generally by topic. Users view feed content in the <a href="@aggregator">main aggregator display</a>, or by <a href="@aggregator-sources">their source</a> (usually via an RSS feed reader). The most recent content in a feed or category can be displayed as a block through the <a href="@admin-block">Blocks administration page</a>.
ru: Ленты могут быть сгруппированы по категориям. Обычно такую группировку делают исходя из тематики ленты, например, ленты могут собираться в категории «Спорт», «Компьютеры» или «Новости». Пользователи могут просматривать собираемые ленты на <a href="@aggregator">основной странице</a> агрегатора или просматривать содержание по <a href="@aggregator-sources">источникам лент</a>. Для каждой добавленной ленты генерируется свой блок, который <a href="@admin-block">можно вывести</a> в каком-либо регионе темы.

source: Adding, editing, and deleting feeds
ru: Добавление, правка и удаление лент

source: Administrators can add, edit, and delete feeds, and choose how often to check each feed for newly updated items on the <a href="@feededit">Feed aggregator administration page</a>.
ru: Управляющие сайтом могут добавлять, редактировать и удалять ленты, а также настраивать интервал их обновления на <a href="@feededit">странице лент</a>.

source: OPML integration
ru: Поддержка OPML

source: A <a href="@aggregator-opml">machine-readable OPML file</a> of all feeds is available. OPML is an XML-based file format used to share outline-structured information such as a list of RSS feeds. Feeds can also be <a href="@import-opml">imported via an OPML file</a>.
ru: Модулем генерируется <a href="@aggregator-opml">OPML-файл</a> лент. Кроме этого, ленты могут быть и <a href="@import-opml">импортированы</a> из OPML-файла.

source: Configuring cron
ru: Настройка <em>cron</em>

source: A correctly configured <a href="@cron">cron maintenance task</a> is required to update feeds automatically.
ru: При настройке интервала обновления лент учитывайте, что обновление лент происходит при <a href="@cron">запуске cron</a>. Таким образом, чтобы лента обновлялась с заданным интервалом, запуск <em>cron</em> должен выполняться с такой же периодичность или чаще.

source: Administer news feeds
ru: Управление новостными лентами

source: View news feeds
ru: Просмотр новостных лент

source: Import OPML
ru: Импорт OPML

source: Configure the behavior of the feed aggregator, including when to discard feed items and how to present feed items and categories.
ru: Настройка сборщика лент, частоты получения и вывода лент на сайте.
