Repository: vitrud/wols
Catalog: modules/blog/translations/modules-blog.*.po
Languages: ru

source: @name's blog
ru: Блог пользователя «@name»

source: Post new blog entry.
ru: Добавить запись

source: You are not allowed to post a new blog entry.
ru: У вас нет прав для добавления записей в блог.

source: You have not created any blog entries.
ru: Записей нет.

source: !author has not created any blog entries.
ru: !author не добавлял записи в блог.

source: RSS - !title
ru: Лента «!title»

source: No blog entries have been created.
ru: Записей нет.

source: RSS - blogs
ru: РСС — блоги

source: Blog entry
ru: Запись в блоге

source: View recent blog entries
ru: Перейти к записям в блоге

source: Blogs
ru: Блоги

source: Recent blog posts
ru: Новое в блогах

source: Read the latest blog entries.
ru: Перейти в блог

source: My blog
ru: Мой блог

source: Read !username's latest blog entries.
ru: Перейти в блог пользователя «!username»

source: !username's blog
ru: Блог пользователя «!username»

source: Use for multi-user blogs. Every user gets a personal blog.
ru: «Запись в блоге» это документ, который используется для добавления записей в сетевой дневник. Записи в блоге упорядочены в обратном хронологическом порядке, то есть новые записи находятся на странице выше старых. Каждый пользователь сайта может вести свой блог.

source: The Blog module allows registered users to maintain an online journal, or <em>blog</em>. Blogs are made up of individual <em>blog entries</em>. By default, the blog entries are displayed by creation time in descending order, with comments enabled, and are promoted to the site's front page. For more information, see the online handbook entry for <a href='@blog'>Blog module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/blog">Blog</a> позволяет пользователям вести свои блоги. Блог каждого пользователя состоит из отдельных записей. По умолчанию, записи в блогах выводятся на первую страницу сайта, их можно комментировать и они упорядочены в обратном хронологическом порядке. Блоги имеют общую РСС-ленту на странице <em>/blog/feed</em>, а для каждого отдельного блога формируется своя РСС-лента на странице <em>/blog/UID/feed</em>. Этим модулем можно пользоваться и для ведения персонального блога, но он предназначен для мультиблоговых сайтов. Для ведения персонального блога обычно используются документы типа «Статья».

source: Single-user blogs
ru: Персональные блоги

source: Each user's blog entries are automatically displayed with a link to the user's main blog page. You can create as many single-user blogs as you have site users with permission to create blog content.
ru: В каждой записи в блоге показывается ссылка, для перехода на обзорную страницу блогов пользователя. У каждого пользователя сайта с соответствующими правами может быть свой собственный блог.

source: Multi-user blogs
ru: Мультиблог

source: Blog entries from each single-user blog are also aggregated into one central multi-user blog, which displays the blog content of all users in a single listing.
ru: Записи из каждого персонального блога собираются в один центральный мультиблог, где показывается содержание всех блогов в одном списоке.

source: There is an optional <em>Blogs</em> menu item added to the Navigation menu, which displays all blogs available on your site, and a <em>My blog</em> item displaying the current user's blog entries.
ru: Модуль добавляет свой пункт, который ведёт на мультиблог в меню навигации. Кроме этого, на блог пользователя добавляется ссылка в профиль пользователя. А на странице со списком записей из всех блогов есть ссылка для добавления записи.

source: The Blog module also creates a default <em>Recent blog posts</em> block that may be enabled at the <a href="@blocks">blocks administration page</a>.
ru: Модулем генерируется блок «Новое в блогах», который можно вывести в нужно регионе со <a href="@blocks">страницы блоков</a>.

source: Create new blog entry
ru: Добавить запись в блог

source: Number of recent blog posts to display
ru: Пункты
