Repository: vitrud/wols
Catalog: modules/php/translations/modules-php.*.po
Languages: ru

source: You may post PHP code. You should include &lt;?php ?&gt; tags.
ru: ПХП-код заключённый в теги &lt;?php...?&gt; будет выполнен

source: Using custom PHP code
ru: Использование своего ПХП-кода

source: If you are unfamiliar with PHP, SQL, or Drupal, avoid using custom PHP code within posts. Experimenting with PHP may corrupt your database, render your site inoperable, or significantly compromise security.
ru: Если вы не знакомы с Друпалом, ПХП, SQL — не используйте ПХП-код. Повреждение базы данных сайта может привести к потери всех данных.

source: Notes:
ru: Отметьте:

source: PHP evaluator
ru: Обработчик ПХП-кода

source: Executes a piece of PHP code. The usage of this filter should be restricted to administrators only!
ru: Позволяет выполнять ПХП-код заключённый в теги. Не включайте этот фильтр, если вы не знаете, что делаете. Роли, которым разрешено использование этого фильтра, имеют полный доступ к базе данных.

source: The PHP filter module adds a PHP filter to your site, for use with <a href="@filter">text formats</a>. This filter adds the ability to execute PHP code in any text field that uses a text format (such as the body of a content item or the text of a comment). <a href="@php-net">PHP</a> is a general-purpose scripting language widely-used for web development, and is the language with which Drupal has been developed. For more information, see the online handbook entry for the <a href="@php">PHP filter module</a>.
ru: Модуль PHP Filter добавляет на сайт одноимённый фильтр, который может использоваться в <a href="@filter">формате ввода</a>. С помощью этого фильтра можно выполнять введённый в поле ПХП-код. Язык <a href="@php-net">ПХП</a> широко используется в веб-разработке, в том числе на нём написан Друпал. Дополнительную информацию можно найти в сетевом руководстве, на странице модуля <a href="http://content-management-systems.info/drupal/project/php">PHP Filter</a>.

source: Enabling execution of PHP in text fields
ru: Выполнение ПХП-кода

source: The PHP filter module allows users with the proper permissions to include custom PHP code that will get executed when pages of your site are processed. While this is a powerful and flexible feature if used by a trusted user with PHP experience, it is a significant and dangerous security risk in the hands of a malicious or inexperienced user. Even a trusted user may accidentally compromise the site by entering malformed or incorrect PHP code. Only the most trusted users should be granted permission to use the PHP filter, and all PHP code added through the PHP filter should be carefully examined before use. <a href="@php-snippets">Example PHP snippets</a> can be found on Drupal.org.
ru: Модуль PHP Filter позволяет пользователям с соответствующими правами включать ПХП-код в содержание, который будет выполнен при открытии страницы. Вместе с тем, что это мощная и гибкая возможность, одновременно с этим, эта возможность представляет угрозу безопасности сайта, особенно если ею пользуются неопытные люди. Даже опытные пользователи могут допустить ошибку в ПХП-коде, которая может повредить сайт. Поэтому, всегда следует проверять код на тестовом сайте, прежде чем использовать его на рабочем. В сетевом руководстве можно найти <a href="@php-snippets">список сниппетов</a>, которые можно использовать вместе с этим фильтром (но которые также следует предварительно проверить на тестовом сайте).

source: Use PHP for settings
ru: Определение параметров ПХП-кодом

source: A <a href="@php-code">PHP code</a> text format has been created.
ru: Формат ввода «<a href="@php-code">ПХП-код</a>» добавлен.
