Repository: vitrud/wols
Catalog: modules/comment/translations/modules-comment.*.po
Languages: ru

source: Posted in
ru: Документ

source: Are you sure you want to delete these comments and all their children?
ru: Удаление комментария и всех ответов на него

source: Delete comments
ru: Удаление комментариев

source: Are you sure you want to delete the comment %title?
ru: Удаление комментария «%title»

source: Any replies to this comment will be lost. This action cannot be undone.
ru: Ответы на этот комментарий будут утеряны. Это действие нельзя отменить.

source: The comment and all its replies have been deleted.
ru: Комментарий и ответы на него удалены.

source: You are not authorized to post comments.
ru: У вас нет права добавлять комментарии.

source: This discussion is closed: you can't post new comments.
ru: Обсуждение закрыто; добавление комментариев запрещено.

source: You are not authorized to view comments.
ru: У вас нет прав для просмотра комментариев.

source: Recent comments
ru: Новые комментарии

source: Jump to the first comment of this posting.
ru: Перейти к первому комментарию

source: Jump to the first new comment of this posting.
ru: Перейти к первому новому комментарию

source: Add a new comment to this page.
ru: Добавить комментарий

source: Share your thoughts and opinions related to this posting.
ru: Перейти к форме комментирования

source: Comment settings
ru: Комментирование

source: Anonymous commenting
ru: Анонимное комментирование

source: Anonymous posters may not enter their contact information
ru: Анонимы могут не вводить свои контактные данные

source: Anonymous posters may leave their contact information
ru: Анонимы могут вводить свои контактные данные

source: Anonymous posters must leave their contact information
ru: Анонимы обязаны ввести свои контактные данные

source: Preview comment
ru: Просмотр

source: reply
ru: ответить

source: Publish the selected comments
ru: Опубликовать выбранные комментарии

source: Delete the selected comments
ru: Удалить выбранные комментарии

source: Unpublish the selected comments
ru: Отменить публикацию выбранных комментариев

source: You have to specify a valid author.
ru: Автор введён неверно.

source: The name you used belongs to a registered user.
ru: Это имя принадлежит зарегистрированному пользователю.

source: The e-mail address you specified is not valid.
ru: Адрес почты введён неверно.

source: The URL of your homepage is not valid. Remember that it must be fully qualified, i.e. of the form <code>http://example.com/directory</code>.
ru: Адрес введён неверно. Используйте при вводе абсолютный адрес, например: «http://example.com/example».

source: Homepage
ru: Домашняя страница

source: (No subject)
ru: (без заголовка)

source: Unpublish comment
ru: Отменить публикацию комментария

source: Unpublish comment containing keyword(s)
ru: Отменить публикацию комментария содержащего слова

source: Unpublished comment %subject.
ru: Публикация комментария %subject отменена.

source: 1 new comment
ru: 1 новый комментарий

source: Published comments
ru: Опубликованные комментарии

source: Number of comments
ru: Количество комментариев

source: Publish comment
ru: Опубликовать комментарий

source: Select one or more comments to perform the update on.
ru: Комментарии не выбраны.

source: Deleted @count comments.
ru: Удалённые комментарии: @count.

source: Comment count
ru: Счётчик комментариев

source: The number of comments posted on a node.
ru: Количество комментариев добавленных документу.

source: Comment ID
ru: Номер комментария.

source: The unique ID of the comment.
ru: Номер комментария.

source: IP Address
ru: IP-адрес

source: The IP address of the computer the comment was posted from.
ru: IP-адрес компьютера с которого был добавлен комментарий.

source: The name left by the comment author.
ru: Имя оставленное автором комментария.

source: Email address
ru: Почта

source: The email address left by the comment author.
ru: Почтовый адрес оставленный автором комментария.

source: Home page
ru: Домашняя страница

source: The home page URL left by the comment author.
ru: Адрес домашней страницы оставленный автором комментария.

source: The title of the comment.
ru: Заголовок комментария.

source: The URL of the comment.
ru: Адрес комментария.

source: The URL of the comment's edit page.
ru: Адрес страницы правки комментария.

source: The date the comment was posted.
ru: Дата добавления комментария.

source: The comment's parent, if comment threading is active.
ru: Комментарий, в который вложен текущий комментарий (если активен ветвящийся список вывода комментариев).

source: The node the comment was posted to.
ru: Документ к которому был добавлен комментарий.

source: The author of the comment, if they were logged in.
ru: Автор комментария (если комментарий добавлен из аккаунта).

source: The Comment module allows users to comment on site content, set commenting defaults and permissions, and moderate comments. For more information, see the online handbook entry for <a href="@comment">Comment module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/comment">Comment</a> позволяет пользователям добавлять комментарии к документам, отвечать на комментарии других пользователей и вести обсуждения. Также, как и документам, комментариям могут быть добавлены новые поля разных типов и они может быть настроен их вывод. У комментариев относящихся к разным типам документов могут быть разные наборы полей.

source: Default and custom settings
ru: Параметры комментариев

source: Each <a href='@content-type'>content type</a> can have its own default comment settings configured as: <em>Open</em> to allow new comments, <em>Hidden</em> to hide existing comments and prevent new comments, or <em>Closed</em> to view existing comments, but prevent new comments. These defaults will apply to all new content created (changes to the settings on existing content must be done manually). Other comment settings can also be customized per content type, and can be overridden for any given item of content. When a comment has no replies, it remains editable by its author, as long as the author has a user account and is logged in.
ru: Каждый <a href='@content-type'>тип документов</a> имеет свои параметры для своих комментариев. Параметр «Открыто» позволяет добавлять новые комментарии, «Скрыто» скрывает существующие комментарии и не позволяет добавлять новые, «Закрыто» не позволяет добавлять новые комментарии, но не скрывает существующие. Параметры комментирования выставленные на странице настройки типа документа используются по умолчанию и их изменение доступно только пользователям с соответствующими правами. Другие параметры могут быть также настроены. Если комментарий не имеет ответов, то он доступен его автору для редактирования.

source: Comment approval
ru: Проверка комментариев

source: Comments from users who have the <em>Skip comment approval</em> permission are published immediately. All other comments are placed in the <a href='@comment-approval'>Unapproved comments</a> queue, until a user who has permission to <em>Administer comments</em> publishes or deletes them. Published comments can be bulk managed on the <a href='@admin-comment'>Published comments</a> administration page.
ru: Комментарии добавленные пользователями с правом «Добавление комментариев без проверки» публикуются сразу. Все другие комментарии помещаются в <a href='@comment-approval'>список неопубликованных</a>, до тех пор, пока пользователь с правом «Управление комментариями» не опубликует их. Опубликованные комментарии могут управляться группами на <a href='@admin-comment'>странице комментариев</a>.

source: @node_type comment
ru: @node_type (поле комментария)

source: Author textfield
ru: Текстовое поле: автор

source: Subject textfield
ru: Текстовое поле: заголовок

source: Unapproved comments (@count)
ru: Неопубликованные комментарии: @count

source: Administer comments and comment settings
ru: Управление комментариями

source: View comments
ru: Просмотр комментариев

source: Post comments
ru: Добавление комментариев

source: Skip comment approval
ru: Добавление комментариев без проверки

source: Edit own comments
ru: Правка своих комментариев

source: Number of recent comments
ru: Пункты

source: approve
ru: принять

source: Default comment setting for new content
ru: Возможность комментирования

source: Open
ru: Открыто

source: Threading
ru: Ветвящийся список

source: Show comment replies in a threaded list.
ru: Вывод комментариев в виде ветвящегося списка, когда ответ на комментарий показывается с отступом относительного этого комментария.

source: Comments per page
ru: Комментариев на странице

source: Allow comment title
ru: Включить поле заголовка комментария

source: Show reply form on the same page as comments
ru: Показывать форму комментирования на странице документа

source: Users with the "Post comments" permission can post comments.
ru: Пользователи с правом «Добавление комментариев» смогут комментировать этот документ.

source: Users cannot post comments, but existing comments will be displayed.
ru: Пользователи не смогут добавлять комментарии, уже добавленные комментарии будут показываться.

source: Comments are hidden from view.
ru: Пользователи не смогут добавлять комментарии, уже добавленные комментарии будут скрыты.

source: Users cannot post comments.
ru: Комментирование документа запрещено.

source: Edit comment %comment
ru: Редактирование комментария «%comment»

source: Your comment has been queued for review by site administrators and will be published after approval.
ru: Комментарий сохранён и будет опубликован после проверки.

source: Your comment has been posted.
ru: Комментарий сохранён.

source: Permalink
ru: Ссылка

source: <a href="@login">Log in</a> or <a href="@register">register</a> to post comments
ru: <a href="@login">Войдите в аккаунт</a> для комментирования

source: <a href="@login">Log in</a> to post comments
ru: <a href="@login">Войдите в аккаунт</a> для комментирования

source: Flat list
ru: Плоский список

source: Threaded list
ru: Ветвящийся список

source: Save comment
ru: Сохранить комментарий

source: The comment will be unpublished if it contains any of the phrases above. Use a case-sensitive, comma-separated list of phrases. Example: funny, bungee jumping, "Company, Inc."
ru: Публикация комментария будет отменена, если в его содержании будет найдено хотя бы одно слово из списка. Вводите слова разделяя их запятыми. Учитывается регистр введённых знаков.

source: List and edit site comments and the comment approval queue.
ru: Просмотр и правка опубликованных комментариев и комментариев ждущих проверки.

source: Comment permalink
ru: Ссылка на комментарий

source: View comment
ru: Просмотр

source: Approve
ru: Принять

source: @number comments per page
ru: Комментарии на странице: @number
