Repository: vitrud/wols
Catalog: modules/locale/translations/modules-locale.*.po
Languages: ru

source: Right to left
ru: Справа налево

source: Left to right
ru: Слева направо

source: Code
ru: Код

source: English name
ru: Английское название

source: Native name
ru: Родное название

source: Direction
ru: Направление

source: Configuration saved.
ru: Конфигурация сохранена.

source: Predefined language
ru: Выбрать язык

source: Language name
ru: Язык

source: Custom language
ru: Добавить язык

source: Add custom language
ru: Добавить

source: Save language
ru: Сохранить

source: Language code
ru: Код языка

source: <a href="@rfc4646">RFC 4646</a> compliant language identifier. Language codes typically use a country code, and optionally, a script or regional variant name. <em>Examples: "en", "en-US" and "zh-Hant".</em>
ru: Код языка совместимый с <a href="@rfc4646">RFC 4646</a>. Языки обычно используют код страны и дополнительно код местности. Примеры: «en», «en-US», «zh-Hant».

source: Language name in English
ru: Английское название

source: Name of the language in English. Will be available for translation in all languages.
ru: Английское название языка.

source: Native language name
ru: Родное название

source: Name of the language in the language being added.
ru: Родное название языка.

source: Path prefix
ru: Префикс пути

source: Language domain
ru: Домен языка

source: Direction that text in this language is presented.
ru: Направление письма на этом языке.

source: The language %language (%code) already exists.
ru: Язык %language (%code) уже существует.

source: Invalid language code.
ru: Код языка введён неверно.

source: The language %language has been created and can now be used. More information is available on the <a href="@locale-help">help screen</a>.
ru: Язык «%language» добавлен и готов к использованию. Дополнительную информацию можно найти на странице справки модуля <a href="@locale-help">Locale</a>.

source: Domain and path prefix values should not be set at the same time.
ru: Введите префикс языка или домен языка — заполнять два этих поля одновременно нельзя.

source: The English language cannot be deleted.
ru: Английский язык не может быть удалён.

source: The default language cannot be deleted.
ru: Стандартный язык не может быть удалён.

source: Are you sure you want to delete the language %name?
ru: Удаление языка «%name»

source: Deleting a language will remove all interface translations associated with it, and posts in this language will be set to be language neutral. This action cannot be undone.
ru: Удаление языка приведёт к удалению из базы данных всех переводов, которые связаны с этим языком. Документы, для которых используется этот язык, после удаления, будут переключены на использование нейтрального языка. Это действие нельзя отменить.

source: The language %locale has been removed.
ru: Язык «%locale» удалён.

source: Language negotiation configuration saved.
ru: Параметры сохранены.

source: English (built-in)
ru: Английский (системный)

source: String contains
ru: Содержание строки

source: Leave blank to show all strings. The search is case sensitive.
ru: <ul> <li>Поиск чувствителен к регистру знаков.</li> <li>Не заполняйте это поле, если хотите вывести все строки.</li> </ul>

source: English (provided by Drupal)
ru: Английский (системный)

source: Search in
ru: Область поиска

source: Both translated and untranslated strings
ru: Все строки

source: Only translated strings
ru: Переведённые строки

source: Only untranslated strings
ru: Непереведённые строки

source: Limit search to
ru: Ограничение поиска

source: All text groups
ru: Все группы

source: Already added languages
ru: Добавленные языки

source: Languages not yet added
ru: Языки не добавлялись

source: Import translation
ru: Импорт

source: Language file
ru: Файл

source: A Gettext Portable Object (<em>.po</em>) file.
ru: Выберите файл перевода в формате Gettext Portable Object (.po).

source: Import into
ru: Язык

source: Choose the language you want to add strings into. If you choose a language which is not yet set up, it will be added.
ru: Выберите язык в который будет добавлен перевод. Если выбранный язык на сайте ещё не установлен, то он будет установлен автоматически в процессе импорта.

source: Imported translations will be added to this text group.
ru: Импортируемый перевод будет добавлен в выбранную группу текста.

source: Mode
ru: Способ

source: The language %language has been created.
ru: Язык %language добавлен.

source: The translation import of %filename failed.
ru: Импорт перевода из файла %filename неудачен.

source: File to import not found.
ru: Файл не найден.

source: Export translation
ru: Перевод

source: Select the language to export in Gettext Portable Object (<em>.po</em>) format.
ru: Выберите язык для экспорта перевода в формат Gettext Portable Object (.po).

source: Export template
ru: Шаблон

source: Generate a Gettext Portable Object Template (<em>.pot</em>) file with all strings from the Drupal locale database.
ru: Будет сгенерирован файл шаблона в формате Gettext Portable Object Template (.pot), в который будут включены все строки из используемой базы данных.

source: String not found.
ru: Ничего не найдено.

source: Original text
ru: Оригинал

source: Save translations
ru: Сохранить

source: The string has been saved.
ru: Перевод сохранён.

source: The string has been removed.
ru: Срока удалена.

source: This page provides an overview of available translatable strings. Drupal displays translatable strings in text groups; modules may define additional text groups containing other translatable strings. Because text groups provide a method of grouping related strings, they are often used to focus translation efforts on specific areas of the Drupal interface.
ru: Друпал позволяет использовать на сайте любое количество языков и показывает статус перевода для каждого из включенных языков. Строки доступные для перевода делятся на группы. Стандартные строки входят в группу «Система», дополнительные модули могут определять свои группы текста. Группы текста содержат связанные с определённым вопросом строки и используются для обращения внимания переводчика на определённые области интерфейса, в которых они используются.

source: Note that the <em>.po</em> files within a translation package are imported automatically (if available) when new modules or themes are enabled, or as new languages are added. Since this page only allows the import of one <em>.po</em> file at a time, it may be simpler to download and extract a translation package into your Drupal installation directory and <a href="@language-add">add the language</a> (which automatically imports all <em>.po</em> files within the package). Translation packages are available for download on the <a href="@translations">Drupal translation page</a>.
ru: Файлы в формате Gettext Portable Object (.po) могут находится в пакетах проектов. Если в папке с проектом лежат файлы с его переводом, то при включении проекта они импортируются автоматически (импортируются переводы только для установленных на сайте языков).

source: This page exports the translated strings used by your site. An export file may be in Gettext Portable Object (<em>.po</em>) form, which includes both the original string and the translation (used to share translations with others), or in Gettext Portable Object Template (<em>.pot</em>) form, which includes the original strings only (used to create new translations with a Gettext translation editor).
ru: Экспорт перевода используется для его распространения. При экспорте перевода, файл сохраняется в формате Gettext Portable Object (.po), который содержит оригинальные строки и их переводы. Экспорт шаблона используется для выполнения перевода в локальной программе. При экспорте шаблона, файл сохраняется в формате Gettext Portable Object Template (.pot), который содержит только оригинальные строки.

source: Built-in interface
ru: Система

source: Language settings
ru: Язык

source: This account's default language for e-mails, and preferred language for site presentation.
ru: Выберите предпочитаемый язык.

source: This account's default language for e-mails.
ru: Выберите предпочитаемый язык.

source: Multilingual support
ru: Поддержка мультиязычности

source: Enable multilingual support for this content type. If enabled, a language selection field will be added to the editing form, allowing you to select from one of the <a href="!languages">enabled languages</a>. If disabled, new posts are saved with the default language. Existing content will not be affected by changing this option.
ru: При выключенной поддержке мультиязычности, документы сохраняются на том языке, который используется на сайте по умолчанию. При включении мультиязычности, на страницы добавления и правки документа будет добавлено поле выбора языка документа. При разрешении перевода документов, документам будет добавлена вкладка разрешающая их перевод на включенные на сайте языки и будет отслеживаться актуальность перевода. Мультиязычность будет применяться только к новым документам.

source: Configure languages for content and the user interface.
ru: Настройка используемых на сайте языков для аккаунтов пользователей и документов.

source: Edit language
ru: Правка языка

source: Translate interface
ru: Перевод

source: Translate the built in interface and optionally other text.
ru: Перевод интерфейса. Экспорт и импорт переводов и шаблонов для последующего перевода.

source: Overview
ru: Информация

source: Edit string
ru: Перевод строки

source: Delete string
ru: Удаление строки

source: The submitted string contains disallowed HTML: %string
ru: Сохраняемая строка содержит неразрешённый ХТМЛ-тег: %string.

source: Are you sure you want to delete the string "%source"?
ru: Удаление строки «%source»

source: Deleting the string will remove all translations of this string in all languages. This action cannot be undone.
ru: Удаление строки приведёт к удалению переводов этой строки на все языки. Это действие нельзя отменить.

source: Attempted submission of a translation string with disallowed HTML: %string
ru: Попытка сохранения строки перевода с неразрешённым ХТМЛ-тегом: %string

source: A path alias set for a specific language will always be used when displaying this page in that language, and takes precedence over path aliases set for <em>All languages</em>.
ru: Альтернативный адрес будет использоваться при просмотре страницы на выбранном языке. Установка альтернативного адреса для конкретного языка имеет приоритет перед альтернативным адресом для страниц на всех языках. Используйте относительный адрес и не используйте слеш в начале и в конце адреса.

source: Enabled languages
ru: Включенные языки

source: Default language
ru: Стандартный язык

source: Use the <em>Custom language</em> section below if your desired language does not appear in this list.
ru: Выберите язык в раскрывающемся списке и нажмите кнопку «Добавить язык».

source: Path prefix language code
ru: Префикс языка

source: Language code or other custom text to use as a path prefix for URL language detection, if your <em>Detection and selection</em> settings use URL path prefixes. For the default language, this value may be left blank. <strong>Modifying this value may break existing URLs. Use with caution in a production environment.</strong> Example: Specifying "deutsch" as the path prefix code for German results in URLs like "example.com/deutsch/contact".
ru: Введённое значение будет использоваться в УРЛ страниц сайта. Обычно, в качестве префикса пути используют код языка или любое другое обозначение, которое будет легко понято пользователями. Например, для русского языка можно ввести «russian». В этом случае УРЛ страницы будет выглядеть как «example.com/russian/...». Отметьте: изменение этого параметра может привести к тому, что существующие ссылки станут ссылаться на несуществующие адреса, так как изменение этого параметра приведёт к изменению УРЛ страницы.

source: @type language detection
ru: Определение языка, тип: @type

source: Detection method
ru: Способ

source: Part of the URL that determines language
ru: Часть УРЛ

source: Domain
ru: Домен

source: <em>Path prefix</em>: URLs like http://example.com/de/contact set language to German (de). <em>Domain</em>: URLs like http://de.example.com/contact set the language to German. <strong>Warning: Changing this setting may break incoming URLs. Use with caution on a production site.</strong>
ru: Если используется префикс пути, то для УРЛ вида «http://example.com/ru/contact», будет использоваться русский язык. Если используется домен, то для УРЛ вида «http://ru.example.com/contact», будет использоваться русский язык. Отметьте: изменение этого параметра может привести к тому, что существующие ссылки станут ссылаться на несуществующие адреса, так как изменение этого параметра приведёт к изменению УРЛ страницы.

source: Request/session parameter
ru: Параметр запроса/сессии

source: Name of the request/session parameter used to determine the desired language.
ru: Значение параметра запроса/сессии, которое будет использоваться для определения языка.

source: Filter translatable strings
ru: Фильтр

source: Strings in the uploaded file replace existing ones, new ones are added. The plural format is updated.
ru: Новые строки добавить, существующие заменить (форма множественного числа обновится)

source: Existing strings and the plural format are kept, only new strings are added.
ru: Новые строки добавить, существующие сохранить (форма множественного числа не обновится)

source: Are you sure you want to reset the date formats for %language to the global defaults?
ru: Сброс параметров форматов дат для языка «%language» к стандартным значениям

source: Resetting will remove all localized date formats for this language. This action cannot be undone.
ru: Сброс параметров удалит все локализованные форматы дат для этого языка. Это действие нельзя отменить.

source: The Locale module allows your Drupal site to be presented in languages other than the default English, and to be multilingual. The Locale module works by maintaining a database of translations, and examining text as it is about to be displayed. When a translation of the text is available in the language to be displayed, the translation is displayed rather than the original text. When a translation is unavailable, the original text is displayed, and then stored for review by a translator. For more information, see the online handbook entry for <a href="@locale">Locale module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/locale">Locale</a> позволяет использовать на сайте интерфейс на различных языках, которые отличаются от английского. Модуль работает управляя переводами строк интерфейса в базе данных, проверяя наличие перевода каждой нужной строки перед её выводом на монитор. Если строка с переводом доступна, то она показывается вместо оригинальной строки. Когда строка с переводом недоступна, то показывается оригинальная строка на английском языке, что позволяет избежать отсутствия на сайте каких-либо элементов, если они не переведены.

source: Translating interface text
ru: Перевод интерфейса

source: Translations of text in the Drupal interface may be provided by:
ru: Интерфейс может быть переведён несколькими способами:

source: Translating within your site, using the Locale module's integrated <a href='@translate'>translation interface</a>.
ru: Через страницу <a href='@translate'>перевода строк</a>.

source: Importing files from a set of existing translations, known as a translation package. A translation package enables the display of a specific version of Drupal in a specific language, and contains files in the Gettext Portable Object (<em>.po</em>) format. Although not all languages are available for every version of Drupal, translation packages for many languages are available for download from the <a href="@translations">Drupal translations page</a>.
ru: Путём импорта готовых переводов, известных как пакет перевода. Пакет перевода содержит файлы с переводами строк в формате Gettext Portable Object (.po) и позволяет показывать интерфейс на выбранном языка. Пакеты перевода существуют для многих языков и версии системы, их можно загрузить с <a href="@translations">сервера переводов</a>.

source: If an existing translation package does not meet your needs, the Gettext Portable Object (<em>.po</em>) files within a package may be modified, or new <em>.po</em> files may be created, using a desktop Gettext editor. The Locale module's <a href='@import'>import</a> feature allows the translated strings from a new or modified <em>.po</em> file to be added to your site. The Locale module's <a href='@export'>export</a> feature generates files from your site's translated strings, that can either be shared with others or edited offline by a Gettext translation editor.
ru: Если готовый пакет переводов вас не устраивает, вы можете изменить входящие в него файлы в формате Gettext Portable Object (.po) используя специальные программы или создать новые .po-файлы. Модуль позволяет <a href='@import'>импортировать</a> на сайт переводы из .po-файлов, а также <a href='@export'>экспортировать</a> переводы с сайта, которые в дальнейшем можно импортировать на другой сайт или воспользоваться программой для редактирования перевода.

source: Configuring a multilingual site
ru: Настройка мультиязычности

source: Language negotiation allows your site to automatically change language based on the domain or path used for each request. Users may (optionally) select their preferred language on their <em>My account</em> page, and your site can be configured to honor a web browser's preferred language settings. Site content can be translated using the <a href='@content-help'>Content translation module</a>.
ru: Условия определённые для языка позволяют автоматически использовать в адресах страниц сайта нужный язык основываясь на домене или дополнительной части адреса. Пользователи могут выбрать предпочитаемый ими язык в своём аккаунте, а анонимным посетителям сайт может показываться на предпочитаемым ими языке в зависимости от параметров их браузеров. Документы сайта могут быть переведены с использованием модуля <a href='@content-help'>Content translation</a>.

source: With multiple languages enabled, interface text can be translated, registered users may select their preferred language, and authors can assign a specific language to content. <a href="@translations">Download contributed translations</a> from Drupal.org.
ru: Включение нескольких языков позволит переводить на эти языки интерфейс сайта и содержание документов. Скачать переводы на большинство языков можно с сайта <a href="@translations">localize.drupal.org</a>.

source: Add a language to be supported by your site. If your desired language is not available in the <em>Language name</em> drop-down, click <em>Custom language</em> and provide a language code and other details manually. When providing a language code manually, be sure to enter a standardized language code, since this code may be used by browsers to determine an appropriate display language.
ru: Добавление языка приведёт к поддержки этого языка сайтом, что позволит перевести на этот язык интерфейс сайта и элементы страниц. Если в секции «Выбрать язык» не содержится нужного языка, то его можно добавить воспользовавшись секцией «Добавить язык». Для добавляемого языка нужно определить различные параметры, будьте особенно внимательны при указании кода языка, так как этот код может использоваться браузерами для определения языка, на котором нужно показывать содержание сайта.

source: Define how to decide which language is used to display page elements (primarily text provided by Drupal and modules, such as field labels and help text). This decision is made by evaluating a series of detection methods for languages; the first detection method that gets a result will determine which language is used for that type of text. Define the order of evaluation of language detection methods on this page.
ru: Определение языка выполняется для того, чтобы показать пользователю элементы интерфейса сайта на том языке, который он предпочитает. К элементам относятся заголовки и описания полей, кнопки, системные сообщения, справочный текст и так далее. Для определения языка можно использовать сразу несколько способов.

source: Determine the language from a request/session parameter. Example: "http://example.com?language=de" sets language to German based on the use of "de" within the "language" parameter.
ru: Если используется определение языка на основе запроса/параметра сессии, то запрос УРЛ вида http://example.com?language=ru, приведёт к тому, что будет использовать русский язык (если в качестве префикса пути или домена используется значение «ru»).

source: See the <a href="@languages">Languages page</a> for more information on adding support for additional languages.
ru: Добавление на сайт новых языков и правила работы с языками, выполняется на <a href="@languages">странице языков</a>.

source: This page imports the translated strings contained in an individual Gettext Portable Object (<em>.po</em>) file. Normally distributed as part of a translation package (each translation package may contain several <em>.po</em> files), a <em>.po</em> file may need to be imported after offline editing in a Gettext translation editor. Importing an individual <em>.po</em> file may be a lengthy process.
ru: Для любого языка можно импортировать перевод из файла в формате Gettext Portable Object (.po). Этот формат является стандартным и поддерживается всеми программами для локального перевода. Отметьте: импорт файла может занять продолжительное время.

source: This page allows a translator to search for specific translated and untranslated strings, and is used when creating or editing translations. (Note: For translation tasks involving many strings, it may be more convenient to <a href="@export">export</a> strings for offline editing in a desktop Gettext translation editor.) Searches may be limited to strings found within a specific text group or in a specific language.
ru: Интерфейс сайта позволяет переводить найденные строки. Отметьте: для перевода большого объёма текста, более удобным будет воспользоваться вкладкой «<a href="@export">Экспорт</a>», чтобы экспортировать найденные строки и воспользоваться локальным редактором. Поиск можно ограничить определённым языком, а также выполнять поиск по уже переведённому или ещё не переведённому тексту.

source: Administer languages
ru: Управление языками

source: Translate interface texts
ru: Перевод интерфейса

source: User interface text
ru: интерфейс

source: Order of language detection methods for user interface text. If a translation of user interface text is available in the detected language, it will be displayed.
ru: Определите порядок способов определения языка. Если определённый язык на сайте включен, то интерфейс будет показываться на этом языке. Если определённые язык на сайте выключен, то интерфейс будет показываться на языке использующемся на сайте по умолчанию.

source: Determine the language from the URL (Path prefix or domain).
ru: Определение языка на основе УРЛ (домена или префикса).

source: Session
ru: Сессия

source: Determine the language from a request/session parameter.
ru: Определение языка на основе параметра запроса/сессии

source: Follow the user's language preference.
ru: Определение языка на основе параметров аккаунта.

source: Determine the language from the browser's language settings.
ru: Определение языка на основе параметров браузера.

source: Interface
ru: Интерфейс

source: Language switcher (@type)
ru: Выбор языка: @type

source: Detection and selection
ru: Настройка

source: URL language detection configuration
ru: Определение языка на основе УРЛ

source: Session language detection configuration
ru: Определение языка на основе параметра запроса/сессии
