Repository: vitrud/wols
Catalog: modules/locale/translations/modules-locale.*.po
Languages: ru

source: Localize
ru: Локализация

source: Localize date formats
ru: Локализация форматов дат

# Long month name
source: January
ru: Январь

# Long month name
source: February
ru: Февраль

# Long month name
source: March
ru: Март

# Long month name
source: April
ru: Апрель

# Long month name
source: May
ru: Май

# Long month name
source: June
ru: Июнь

# Long month name
source: July
ru: Июль

# Long month name
source: August
ru: Август

# Long month name
source: September
ru: Сентябрь

# Long month name
source: October
ru: Октябрь

# Long month name
source: November
ru: Ноябрь

# Long month name
source: December
ru: Декабрь

source: Next
ru: Далее

source: Today
ru: Сегодня

source: January
ru: Январь

source: February
ru: Февраль

source: March
ru: Март

source: April
ru: Апрель

source: June
ru: Июнь

source: July
ru: Июль

source: August
ru: Август

source: September
ru: Сентябрь

source: October
ru: Октябрь

source: November
ru: Ноябрь

source: December
ru: Декабрь

source: Su
ru: Вс

source: Mo
ru: Пн

source: Tu
ru: Вт

source: We
ru: Ср

source: Th
ru: Чт

source: Fr
ru: Пн

source: Sa
ru: Сб

source: mm/dd/yy
ru: мм/дд/гг
