Repository: vitrud/wols
Catalog: modules/field/modules/text/translations/modules-field-modules-text.*.po
Languages: ru

source: The Text module defines various text field types for the Field module. A text field may contain plain text only, or optionally, may use Drupal's <a href='@filter-help'>text filters</a> to securely manage HTML output. Text input fields may be either a single line (text field), multiple lines (text area), or for greater input control, a select box, checkbox, or radio buttons. If desired, the field can be validated, so that it is limited to a set of allowed values. See the <a href='@field-help'>Field module help page</a> for more information about fields.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/field/text">Text</a> определяет различные текстовые типы полей для модуля <a href='@field-help'>Field</a>. Текстовое поле может содержать только обычный текст или может использовать <a href='@filter-help'>текстовые фильтры</a> для безопасного управления выводом ХТМЛ-тегов. Текстовые поля ввода могут быть однострочными (текстовое поле), многострочными (текстовая область), списками выбора, флажками или радиокнопками. Текстовое поле может также проходить проверку, таким образом в нём можно ограничить набор допустимых значений.

source: Long text
ru: Текстовая область

source: Long text and summary
ru: Текстовая область и анонс

source: Maximum length
ru: Максимальная длина

source: The maximum length of the field in characters.
ru: Максимальное количество знаков, которое можно использовать в поле.

source: Text processing
ru: Обработка текста

source: Filtered text (user selects text format)
ru: С применением фильтров (формат ввода выбирается пользователем)

source: Summary input
ru: Ввод краткого содержания

source: This allows authors to input an explicit summary, to be displayed instead of the automatically trimmed text when using the "Summary or trimmed" display type.
ru: Добавление ссылки «Ввести краткое содержание», что позволит автору документа самостоятельно вводить краткое содержание. Если ввод краткого содержания недоступен, то оно будет формироваться автоматически из первых фраз документа.

source: Trimmed
ru: Обрезанный текст

source: Summary or trimmed
ru: Краткое содержание или обрезанный текст

source: Trim length
ru: Количество знаков

source: Text area (multiple rows)
ru: Текстовая область

source: Text area with a summary
ru: Текстовая область с анонсом

source: Size of textfield
ru: Знаки

source: Rows
ru: Строки

source: Leave blank to use trimmed value of full text as the summary.
ru: Если оставить это поле незаполненным, то краткое содержание документа будет сформировано из первых фраз полного содержания.

source: Hide summary
ru: Не вводить краткое содержание

source: Edit summary
ru: Ввести краткое содержание
