Repository: vitrud/wols
Catalog: modules/block/translations/modules-block.*.po
Languages: ru

source: Region
ru: Регион

source: No blocks in this region
ru: В этом регионе блоков нет.

source: Save blocks
ru: Сохранить

source: The block settings have been updated.
ru: Параметры сохранены.

source: Block title
ru: Название

source: The title of the block as shown to the user.
ru: Название блока, которое будет показываться пользователям.

source: '%name' block
ru: Настройка блока «%name»

source: Allow individual users to customize the visibility of this block in their account settings.
ru: Пользователи могут выбирать параметры видимости блоков в своих аккаунтах.

source: Show block for specific roles
ru: Показывать блок ролям

source: Show this block only for the selected role(s). If you select no roles, the block will be visible to all users.
ru: Блок будет виден только выбранным ролям. Если ограничивать видимость блока на основе ролей не нужно, то оставьте все поля неотмеченными.

source: Show block on specific pages
ru: Показывать блок

source: Save block
ru: Сохранить

source: The block configuration has been saved.
ru: Параметры сохранены.

source: The block has been created.
ru: Блок добавлен.

source: Are you sure you want to delete the block %name?
ru: Удаление блока «%name»

source: The block %name has been removed.
ru: Блок «%name» удалён.

source: The block %info was assigned to the invalid region %region and has been disabled.
ru: Для блока «%info» указан неверный регион «%region», поэтому блок был выключен.

source: Block description
ru: Описание

source: Block body
ru: Содержание

source: The content of the block as shown to the user.
ru: Информация, которая должна выводиться в блоке.

source: Configure what block content appears in your site's sidebars and other regions.
ru: Включение, выключение, добавление, удаление и настройка блоков.

source: Configure block
ru: Параметры блока

source: Delete block
ru: Удаление блока

source: Add block
ru: Добавить блок

source: The changes to these blocks will not be saved until the <em>Save blocks</em> button is clicked.
ru: Изменения вступят в силу после сохранения формы.

source: Weight for @block block
ru: Вес блока «@block»

source: Region for @block block
ru: Регион блока @block

source: Override the default title for the block. Use <em>!placeholder</em> to display no title, or leave blank to use the default block title.
ru: Название блока показывается посетителям на страницах сайта. <ul> <li>Если название показывать не нужно, то используйте запись !placeholder</li> <li>Если оставить поле незаполненным, то будет использоваться стандартное название</li> </ul>

source: Region settings
ru: Регион

source: Specify in which themes and regions this block is displayed.
ru: Выберите темы и регионы, в которых должен показываться блок.

source: !theme (default theme)
ru: !theme (стандартная тема)

source: !theme (administration theme)
ru: !theme (тема управления)

source: Visibility settings
ru: Параметры видимости

source: All pages except those listed
ru: Исключая перечисленные страницы

source: Only the listed pages
ru: На перечисленных страницах

source: Specify pages by using their paths. Enter one path per line. The '*' character is a wildcard. Example paths are %blog for the blog page and %blog-wildcard for every personal blog. %front is the front page.
ru: Вводите путь к каждой странице в отдельной строке. При указании пути можно использовать знак «*», который заменяет любое количество других знаков. Например, если ввести маску «blog», то действие будет распространяться только на одну страницу с таким путём; если ввести маску «blog/*», то действие будет распространяться на все страницы, путь которых начинается со знаков «blog/»; если ввести маску «*blog*», то действие будет распространяться на все страницы, в путях которых встречается такое сочетание эти четырёх знаков. Для указания первой страницы, используйте запись «%front».

source: Pages on which this PHP code returns <code>TRUE</code> (experts only)
ru: Если введённый ПХП-код возвращает значение <code>ИСТИНА</code>

source: If the PHP option is chosen, enter PHP code between %php. Note that executing incorrect PHP code can break your Drupal site.
ru: Если выбран пункт «Если введённый ПХП-код возвращает значение <code>ИСТИНА</code>», то будет выполнен код, заключённый в теги %php. Отметьте: выполнение неверного ПХП-кода может повредить сайт.

source: Customizable per user
ru: Управление видимостью

source: Customizable, visible by default
ru: Блок виден, но его можно скрыть

source: Customizable, hidden by default
ru: Блок скрыт, но его можно сделать видимым

source: The Block module allows you to create boxes of content, which are rendered into an area, or region, of one or more pages of a website. The core Seven administration theme, for example, implements the regions "Content", "Help", "Dashboard main", and "Dashboard sidebar", and a block may appear in any one of these regions. The <a href="@blocks">Blocks administration page</a> provides a drag-and-drop interface for assigning a block to a region, and for controlling the order of blocks within regions. For more information, see the online handbook entry for <a href="@block">Block module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/block">Block</a> позволяет выводить блоки информации, которые могут размещаться в регионах темы, показывать на определённых страницах, для пользователей определённых ролей и имеют другие параметры. Количество регионов доступных для размещения блоков зависят от используемой вами темы. Тема Seven, например, содержит четыре региона («Документ», «Справка», «Содержание панели» и «Меню панели»), в каждом из которых <a href="@blocks">можно разместить</a> любой блок. Блоки могут формироваться модулями (например, блок «Новое на форумах» формируется модулем Forum) или добавляться самостоятельно.

source: Positioning content
ru: Позиционирование содержания

source: When working with blocks, remember that all themes do <em>not</em> implement the same regions, or display regions in the same way. Blocks are positioned on a per-theme basis. Users with the <em>Administer blocks</em> permission can disable blocks. Disabled blocks are listed on the <a href="@blocks">Blocks administration page</a>, but are not displayed in any region.
ru: При работе с блоками помните, что не все темы имеют одинаковые регионы и выводят их с одинаковыми параметрами. Поэтому, размещение блоков выполняется отдельно для каждой темы. Пользователи с правом «Управление блоками» могут выключать блоки. Выключенные блоки находятся на <a href="@blocks">странице блоков</a>, но не размещены ни в одном из регионов, которые показываются пользователям.

source: Controlling visibility
ru: Управление видимостью

source: Blocks can be configured to be visible only on certain pages, only to users of certain roles, or only on pages displaying certain <a href="@content-type">content types</a>. Administrators can also allow specific blocks to be enabled or disabled by users when they edit their <a href="@user">My account</a> page. Some dynamic blocks, such as those generated by modules, will be displayed only on certain pages.
ru: Блоки могут показываться только на определённых страницах, только пользователям определённых ролей, если открыт документ <a href="@content-type">определённого типа</a> и в зависимости от других параметров. Администраторы могут разрешить или запретить пользователям, самостоятельно определять вывод блоков в своих аккаунтах.

source: Creating custom blocks
ru: Добавление блоков

source: Users with the <em>Administer blocks</em> permission can <a href="@block-add">add custom blocks</a>, which are then listed on the <a href="@blocks">Blocks administration page</a>. Once created, custom blocks behave just like default and module-generated blocks.
ru: Пользователи с правом «Управление блоками» <a href="@block-add">могут добавлять</a> на сайт новые блоки, которые будут появляться на <a href="@blocks">странице блоков</a>, с которой их можно разместить в каком-либо регионе.

source: Use this page to create a new custom block.
ru: После добавления блока, не забудьте разместить его в каком-либо регионе!

source: This page provides a drag-and-drop interface for assigning a block to a region, and for controlling the order of blocks within regions. Since not all themes implement the same regions, or display regions in the same way, blocks are positioned on a per-theme basis. Remember that your changes will not be saved until you click the <em>Save blocks</em> button at the bottom of the page. Click the <em>configure</em> link next to each block to configure its specific title and visibility settings.
ru: Блоки позволяют выводить нужную информацию в различных регионах темы. Так как не все темы имеют одинаковые регионы, могут выводить их с разными параметрами, а регионы с одинаковыми названиями могут выводиться в разных местах страницы, то размещение блоков выполняется отдельно для каждой включенной темы. Параметры, специфичные для каждого отдельного блока, можно определить воспользовавшись ссылками в колонке «Операции».

source: Demonstrate block regions (@theme)
ru: Просмотр регионов: @theme

source: Exit block region demonstration
ru: Выход из режима просмотра регионов

source: A brief description of your block. Used on the <a href="@overview">Blocks administration page</a>.
ru: Описание блока показывается на <a href="@overview">странице блоков</a>.

source: Cache blocks
ru: Включить кеширование блоков

source: Not restricted
ru: Без ограничений

source: The block cannot be placed in this region.
ru: Блок не может быть размещён в этом регионе.
