Repository: vitrud/wols
Catalog: modules/filter/translations/modules-filter.*.po
Languages: ru

source: No roles may use this format
ru: Не одна роль не может использовать этот формат

source: Allowed HTML tags: @tags
ru: Разрешённые ХТМЛ-теги: @tags

source: Anchors are used to make links to other pages.
ru: Ссылка

source: Paragraph one.
ru: Первый абзац.

source: Paragraph two.
ru: Второй абзац.

source: Emphasized
ru: Курсив

source: Cited
ru: Цитата

source: Coded text used to show programming source code
ru: Код

source: Coded
ru: Код

source: Bolded
ru: Выделение полужирным

source: Underlined
ru: Подчёркнутое

source: Italicized
ru: Выделение курсивом

source: Superscripted
ru: В верхнем индексе

source: <sup>Super</sup>scripted
ru: В верхнем <sup>индексе</sup>

source: Subscripted
ru: В нижнем индексе

source: <sub>Sub</sub>scripted
ru: В нижнем <sub>индексе</sub>

source: Preformatted
ru: Включить предварительное форматирование

source: Abbreviation
ru: Аббревиатура

source: <abbr title="Abbreviation">Abbrev.</abbr>
ru: <abbr title="Abbreviation">Аббревиатура</abbr>

source: Acronym
ru: Акроним

source: <acronym title="Three-Letter Acronym">TLA</acronym>
ru: <acronym title="Союз Советских Социалистических Республик">СССР</acronym>

source: Block quoted
ru: Цитата в абзаце

source: Quoted inline
ru: Цитата в строке

source: Table
ru: Таблица

source: Table header
ru: Заголовок таблицы

source: Table cell
ru: Ячейка таблицы

source: Deleted
ru: Удалено

source: Inserted
ru: Вставлено

source: Ordered list - use the &lt;li&gt; to begin each list item
ru: Нумерованный список

source: First item
ru: Первый пункт

source: Second item
ru: Второй пункт

source: Unordered list - use the &lt;li&gt; to begin each list item
ru: Маркированный список

source: Definition lists are similar to other HTML lists. &lt;dl&gt; begins the definition list, &lt;dt&gt; begins the definition term and &lt;dd&gt; begins the definition description.
ru: Список определений

source: First term
ru: Первый термин

source: First definition
ru: Первое определение

source: Second term
ru: Второй термин

source: Second definition
ru: Второе определение

source: Subtitle
ru: Подзаголовок 2

source: Subtitle three
ru: Подзаголовок 3

source: Subtitle four
ru: Подзаголовок 4

source: Subtitle five
ru: Подзаголовок 5

source: Subtitle six
ru: Подзаголовок 6

source: Tag Description
ru: Описание

source: You Type
ru: Набрано

source: You Get
ru: Результат

source: Ampersand
ru: Амперсанд

source: Greater than
ru: Больше

source: Less than
ru: Меньше

source: Quotation mark
ru: Кавычки

source: Character Description
ru: Знак

source: Lines and paragraphs break automatically.
ru: Переносы строк и абзацы формируются автоматически

source: Lines and paragraphs are automatically recognized. The &lt;br /&gt; line break, &lt;p&gt; paragraph and &lt;/p&gt; close paragraph tags are inserted automatically. If paragraphs are not recognized simply add a couple blank lines.
ru: Строки и абзацы распознаются автоматически и к ним добавляются теги &lt;br /&gt;, &lt;p&gt; и &lt;/p&gt;. Если абзацы не распознаются, то используйте для их разделения две пустые строки.

source: Web page addresses and e-mail addresses turn into links automatically.
ru: Адреса страниц и почты преобразуются в ссылки автоматически

source: Maximum link text length
ru: Длина ссылки

source: URLs longer than this number of characters will be truncated to prevent long strings that break formatting. The link itself will be retained; just the text portion of the link will be truncated.
ru: Введите максимальную длину ссылки. Ссылки, длина которых превышает указанное значение, будут обрезаны (работоспособность ссылок при этом не пострадает).

source: Configure how content input by users is filtered, including allowed HTML tags. Also allows enabling of module-provided filters.
ru: Настройка правил обработки содержания документов, комментариев и блоков.

source: Compose tips
ru: Форматы ввода

source: All roles may use this format
ru: Этот формат доступен всем ролям

source: disable
ru: выключено

source: The text format ordering has been saved.
ru: Порядок форматов ввода сохранён.

source: All roles for this text format must be enabled and cannot be changed.
ru: Этот формат может использоваться всеми ролями и это не может быть изменено.

source: Enabled filters
ru: Фильтры

source: Filter processing order
ru: Порядок фильтров

source: Filter settings
ru: Параметры фильтров

source: Text format names must be unique. A format named %name already exists.
ru: Название формата ввода «%name» уже используется.

source: Added text format %format.
ru: Формат ввода «%format» добавлен.

source: The text format %format has been updated.
ru: Формат ввода «%format» обновлён.

source: Are you sure you want to disable the text format %format?
ru: Выключение формата ввода «%format»

source: Disabled text formats are completely removed from the administrative interface, and any content stored with that format will not be displayed. This action cannot be undone.
ru: Выключенные форматы ввода удаляются из интерфейса управления и любое содержание, которое использует этот формат, больше не показывается. Это действие нельзя отменить.

source: Disabled text format %format.
ru: Формат ввода «%format» удалён.

source: Text Formats
ru: Форматы ввода

source: The Filter module allows administrators to configure text formats. A text format defines the HTML tags, codes, and other input allowed in content and comments, and is a key feature in guarding against potentially damaging input from malicious users. For more information, see the online handbook entry for <a href="@filter">Filter module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/filter">Filter</a> позволяет администраторам настраивать различные форматы ввода. Формат ввода определяет разрешённые в содержании ХТМЛ-теги, правила обработки введённых данных и другие параметры, которые зависят от использующихся в этом формате фильтров.

source: Configuring text formats
ru: Настройка форматов

source: Configure text formats on the <a href="@formats">Text formats page</a>. <strong>Improper text format configuration is a security risk</strong>. To ensure security, untrusted users should only have access to text formats that restrict them to either plain text or a safe set of HTML tags, since certain HTML tags can allow embedding malicious links or scripts in text. More trusted registered users may be granted permission to use less restrictive text formats in order to create rich content.
ru: Страница <a href="@formats">форматов ввода</a> позволяет перейти к настройке любого формата ввода. В интересах безопасности, непроверенные пользователи должны иметь доступ только к тем форматам ввода, которые ограничивают используемые ХТМЛ-теги (так как определённые теги позволяют внедрять на страницу различные объекты или скрипты) или выводят всю введённую информацию в виде обычного текста. Проверенные пользователи могут использовать форматы с менее ограниченными параметрами. <strong>Неправильная настройка формата ввода представляет угрозу безопасности сайта!</strong>

source: Applying filters to text
ru: Применение фильтров к содержанию

source: Each text format uses filters to manipulate text, and most formats apply several different filters to text in a specific order. Each filter is designed for a specific purpose, and generally either adds, removes, or transforms elements within user-entered text before it is displayed. A filter does not change the actual content, but instead, modifies it temporarily before it is displayed. One filter may remove unapproved HTML tags, while another automatically adds HTML to make URLs display as clickable links.
ru: Каждый формат ввода использует фильтры для обработки введённого содержания, а большинство форматов применяют сразу несколько фильтров в определённом порядке. Каждый фильтр разработан для определённых целей, в основном для добавления, удаления или изменения элементов в введённом пользователем содержании перед тем, как это содержание будет показано на сайте. Фильтры не изменяют введённое содержание, всё введённое пользователем содержание записывается в базу данных, фильтры лишь обрабатывают это содержание перед его выводом. Один фильтр может удалять перед выводом неразрешённые ХТМЛ-теги, а другой фильтр может автоматически добавлять ХТМЛ для того, чтобы введённый УРЛ стал ссылкой, на которую можно нажать мышкой.

source: Defining text formats
ru: Добавление форматов

source: One format is included by default: <em>Plain text</em> (which removes all HTML tags). Additional formats may be created by your installation profile when you install Drupal, and more can be created by an administrator on the <a href="@text-formats">Text formats page</a>.
ru: Один формат является системным и не может быть удалён. Это формат «Plain text» (который удаляет все ХТМЛ-теги). Дополнительные форматы могут создаваться профилями установок при установке системы или создаваться администраторами сайта со <a href="@text-formats">страницы форматов</a>.

source: Choosing a text format
ru: Выбор формата

source: Users with access to more than one text format can use the <em>Text format</em> fieldset to choose between available text formats when creating or editing multi-line content. Administrators can define the text formats available to each user role, and control the order of formats listed in the <em>Text format</em> fieldset on the <a href="@text-formats">Text formats page</a>.
ru: Если у пользователя есть права дающие доступ более чем к одному формату ввода, то пользователь может выбирать какой формат использовать в том или ином случает. Выбор формата выполняется в секции «Формат ввода», которая показывается вместе с формой редактирования содержания. Администраторы могут определить форматы ввода доступные каждой роли пользователей и управлять порядком форматов, в котором они будут перечислены на <a href="@text-formats">странице форматов</a>.

source: Text formats define the HTML tags, code, and other formatting that can be used when entering text. <strong>Improper text format configuration is a security risk</strong>. Learn more on the <a href="@filterhelp">Filter module help page</a>.
ru: Форматы ввода определяют правила обработки содержания при его выводе на страницу. Для обработки содержания форматы ввода используют фильтры, которые применяются в определённой последовательности. Если роли доступно несколько форматов ввода, то пользователи этой роли могут выбирать, какой из форматов ввода следует использовать для обработки содержания. Дополнительную информацию можно найти на странице справки модуля <a href="@filterhelp">Filter</a>.

source: Text formats are presented on content editing pages in the order defined on this page. The first format available to a user will be selected by default.
ru: При редактировании содержания, форматы ввода показываются в том же порядке, в котором они находятся на этой странице. Первый доступный пользователю формат, будет выбран по умолчанию.

source: A text format contains filters that change the user input, for example stripping out malicious HTML or making URLs clickable. Filters are executed from top to bottom and the order is important, since one filter may prevent another filter from doing its job. For example, when URLs are converted into links before disallowed HTML tags are removed, all links may be removed. When this happens, the order of filters may need to be re-arranged.
ru: Форматы ввода содержат фильтры, которые изменяют данные введённые пользователем, например вырезают неразрешённые ХТМЛ-теги или делают УРЛ ссылками, чтобы на них можно было нажать мышкой. Фильтры применяются сверху вниз и их порядок очень важен, так как к следующему фильтру данные приходят уже изменённые предыдущим фильтром. Например, когда фильтр преобразовывающий УРЛ в ссылки применяется до фильтра удаляющего неразрешённые ХТМЛ-теги, то все ссылки могут быть удалены. Если содержание выводится не в том виде, в котором вы ожидаете его увидеть, то подумайте о переупорядочивании фильтров.

source: Administer text formats and filters
ru: Управление форматами ввода

source: Use the !text_format text format
ru: Использование формата !text_format

source: Warning: This permission may have security implications depending on how the text format is configured.
ru: Предупреждение: в зависимости от включенных в этом формате фильтров, это право может влиять на безопасность сайта.

source: Text format
ru: Формат ввода

source: More information about text formats
ru: Справка

source: Limit allowed HTML tags
ru: Ограничить разрешённые в содержании ХТМЛ-теги

source: Convert line breaks into HTML (i.e. <code>&lt;br&gt;</code> and <code>&lt;p&gt;</code>)
ru: Преобразовывать переносы строк в ХТМЛ (например <code>&lt;br /&gt;</code> и <code>&lt;p&gt;...&lt;/p&gt;</code>)

source: Convert URLs into links
ru: Преобразовывать адреса страниц в ссылки

source: Correct faulty and chopped off HTML
ru: Корректировка неправильных и обрезанных ХТМЛ-тегов

source: Display any HTML as plain text
ru: Показывать любой ХТМЛ-тег как обычный текст

source: A list of HTML tags that can be used. JavaScript event attributes, JavaScript URLs, and CSS are always stripped.
ru: Список доступных ХТМЛ-тегов. Атрибуты событий яваскрипта, УРЛ яваскрипта и ЦСС всегда удаляются.

source: Display basic HTML help in long filter tips
ru: Показывать справку по разрешённым ХТМЛ-тегам

source: Add rel="nofollow" to all links
ru: Добавить всем ссылкам атрибут «rel="nofollow"»

source: This site allows HTML content. While learning all of HTML may feel intimidating, learning how to use a very small number of the most basic HTML "tags" is very easy. This table provides examples for each tag that is enabled on this site.
ru: На сайте разрешено использование ХТМЛ-тегов. В то время, как выучить применение всех тегов может быть достаточно сложной задачей, научиться пользоваться небольшим количеством основных ХТМЛ-тегов очень легко. В таблице, которая находится ниже, приведены примеры работы для всех разрешённых тегов.

source: For more information see W3C's <a href="@html-specifications">HTML Specifications</a> or use your favorite search engine to find other sites that explain HTML.
ru: Дополнительную информацию можно найти в «<a href="http://htmlbook.ru/html">Справочнике ХТМЛ</a>».

# Font weight
source: Strong
ru: Полужирный

source: Heading
ru: Заголовок

source: Most unusual characters can be directly entered without any problems.
ru: Специальные ХТМЛ-знаки могут быть вставлены напрямую.

source: If you do encounter problems, try using HTML character entities. A common example looks like &amp;amp; for an ampersand &amp; character. For a full list of entities see HTML's <a href="@html-entities">entities</a> page. Some of the available characters include:
ru: Если же у вас всё таки возникают проблемы, то попробуйте использовать специальные обозначения обозначения этих знаков. Например, для вставки знака «&amp;», используйте запись «&amp;amp;». Дополнительную информацию можно найти в «<a href="http://wdh.suncloud.ru/entities.htm">Справочнике веб-разработчика</a>».

source: characters
ru: знаков

source: No HTML tags allowed.
ru: ХТМЛ-теги не обрабатываются и показываются как обычный текст

source: filter
ru: Фильтр

source: Missing text format: %format.
ru: Формат ввода «%format» отсутствует.

source: Text formats
ru: Форматы ввода
