Repository: vitrud/wols
Catalog: modules/path/translations/modules-path.*.po
Languages: ru

source: Alias
ru: Альтернативный

source: Existing system path
ru: Системный адрес

source: Path alias
ru: Альтернативный адрес

source: Specify an alternative path by which this data can be accessed. For example, type "about" when writing an about page. Use a relative path and don't add a trailing slash or the URL alias won't work.
ru: Введите альтернативный адрес (псевдоним) по которому будет доступен введённый выше системный адрес. Примеры: «about.html», «forum/open-source/drupal», «site/news». Используйте относительный адрес и не используйте слеш в начале и в конце адреса.

source: The alias %alias is already in use in this language.
ru: Альтернативный адрес %alias уже используется с этим языком.

source: The alias has been saved.
ru: Альтернативный адрес добавлен.

source: Are you sure you want to delete path alias %title?
ru: Удаление адреса «%title»

source: Filter aliases
ru: Поиск путей

source: Enter the path you wish to create the alias for, followed by the name of the new alias.
ru: Введите сначала системный адрес, а затем альтернативный, по которому станет доступна страница.

source: URL path settings
ru: Путь

source: URL aliases
ru: Адреса

source: Change your site's URL paths by aliasing them.
ru: Управление альтернативными адресами — добавление, фильтрация, правка и удаление адресов.

source: Edit alias
ru: Правка адреса

source: Delete alias
ru: Удаление адреса

source: Add alias
ru: Добавить альтернативный адрес

source: No URL aliases available. <a href="@link">Add URL alias</a>.
ru: Альтернативных адресов нет.

source: Specify the existing path you wish to alias. For example: node/28, forum/1, taxonomy/term/1.
ru: Введите существующий системный адрес, для которого добавляется альтернативный. Примеры: «node/1», «forum/1», «taxonomy/term/1».

source: The Path module allows you to specify an alias, or custom URL, for any existing internal system path. Aliases should not be confused with URL redirects, which allow you to forward a changed or inactive URL to a new URL. In addition to making URLs more readable, aliases also help search engines index content more effectively. Multiple aliases may be used for a single internal system path. To automate the aliasing of paths, you can install the contributed module <a href="@pathauto">Pathauto</a>. For more information, see the online handbook entry for the <a href="@path">Path module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/path">Path</a> позволяет добавить любому системному пути на сайте альтернативный путь. Не следует путать альтернативные адресе с перенаправлениями, которые позволяют добраться до изменённого адреса или заменяют неактивный адрес активным. В дополнение к тому, что альтернативные адреса более читаемы чем системны, они также позволяют поисковым системам лучше индексировать содержание. Для каждого системного адреса может использоваться неограниченное количество альтернативных адресов. Для автоматизации процесса добавления альтернативных адресов, можно поставить модуль <a href="http://content-management-systems.info/drupal/project/pathauto">Pathauto</a>.

source: Creating aliases
ru: Добавление пути

source: Users with sufficient <a href="@permissions">permissions</a> can create aliases under the <em>URL path settings</em> section when they create or edit content. Some examples of aliases are:
ru: Пользователи с <a href="@permissions">соответствующими правами</a> могут добавлять альтернативные адреса в их секции при редактировании различных страниц сайта. Некоторые примеры альтернативных адресов:

source: <em>member/jane-smith</em> aliased to internal path <em>user/123</em>
ru: <em>member/jane-smith</em> имеет альтернативный путь <em>user/123</em>

source: <em>about-us/team</em> aliased to internal path <em>node/456</em>
ru: <em>about-us/team</em> имеет альтернативный путь <em>node/456</em>

source: Managing aliases
ru: Управление путями

source: The Path module provides a way to search and view a <a href="@aliases">list of all aliases</a> that are in use on your website. Aliases can be added, edited and deleted through this list.
ru: Модуль Path генерирует страницу со <a href="@aliases">списком альтернативных адресов</a>, на которой можно искать и редактировать существующие на сайте альтернативные пути. На этой страницы могут быть добавлены. отредактированы и удалены альтернативные пути.

source: An alias defines a different name for an existing URL path - for example, the alias 'about' for the URL path 'node/1'. A URL path can have multiple aliases.
ru: Альтернативный адрес определяет другой путь, по которому будет доступен существующий системный. Например, для системного пути «node/1» можно добавить альтернативный — «about». У одного системного пути может быть неограниченное количество альтернативных.

source: Administer URL aliases
ru: Управление альтернативными путями

source: Create and edit URL aliases
ru: Добавление и правка альтернативных путей

source: URL alias
ru: Альтернативный путь

source: Optionally specify an alternative URL by which this content can be accessed. For example, type "about" when writing an about page. Use a relative path and don't add a trailing slash or the URL alias won't work.
ru: Альтернативный путь, по которому будет доступен этот документ. Например, можно ввести в это поле «about», если создаётся документ с информацией о сайте. Используйте относительный адрес и не используйте слеш в начале и в конце адреса. Примеры путей: «news-2.0.html», «category/news».

source: The alias is already in use.
ru: Альтернативный адрес уже используется.

source: Optionally specify an alternative URL by which this term can be accessed. Use a relative path and don't add a trailing slash or the URL alias won't work.
ru: Альтернативный путь, по которому будет доступен этот термин. Используйте относительный путь и не используйте слеш в конце пути.

source: Alias: @alias
ru: Адрес: @alias

source: No alias
ru: Альтернативного адреса нет
