Repository: vitrud/wols
Catalog: modules/contact/translations/modules-contact.*.po
Languages: ru

source: Yes
ru: Да

source: No
ru: Нет

source: Recipients
ru: Получатели

source: Selected
ru: Выбрано

source: Example: 'website feedback' or 'product information'.
ru: Примеры: «Управляющий сайтом», «Информация о товаре», «Служба поддержки».

source: Auto-reply
ru: Автоответчик

source: Optional auto-reply. Leave empty if you do not want to send the user an auto-reply message.
ru: Сообщение, которое будет отправлено сразу после получении входящего сообщения. Пример: «Сообщение получено. Мы постараемся вам ответить как можно скорее.». Если ответ отправлять автоматически не нужно, то оставьте это поле незаполненным.

source: When listing categories, those with lighter (smaller) weights get listed before categories with heavier (larger) weights. Categories with equal weights are sorted alphabetically.
ru: Категории упорядочиваются сначала по весу, а затем по названию.

source: Set this to <em>Yes</em> if you would like this category to be selected by default.
ru: Выберите значение «Да», если хотите, чтобы при переходе на <a href="/contact">контактную форму</a> сайта, данная категория была выбрана по умолчанию.

source: %recipient is an invalid e-mail address.
ru: Почтовый адрес %recipient некорректен.

source: Are you sure you want to delete %category?
ru: Удаление категории «%category»

source: Category %category has been deleted.
ru: Категория «%category» удалена.

source: Your e-mail address
ru: Почта

source: - Please choose -
ru: - выбор не сделан -

source: Send yourself a copy.
ru: Сохранить копию

source: The contact form has not been configured. <a href="@add">Add one or more categories</a> to the form.
ru: Контактная форма сайта не настроена. <a href="@add">Добавьте категорию</a>.

source: Your message has been sent.
ru: Сообщение отправлено.

source: To
ru: Куда

source: Contact settings
ru: Контакт

source: Personal contact form
ru: Персональная контактная форма

source: Message:
ru: Содержание:

source: Contact form
ru: Контакт

source: Create a system contact form and set up categories for the form to use.
ru: Создание контактной формы сайта и настройка персональных контактных форм.

source: Edit contact category
ru: Правка категории

source: No categories available.
ru: Категорий нет.

source: Example: 'webmaster@example.com' or 'sales@example.com,support@example.com' . To specify multiple recipients, separate each e-mail address with a comma.
ru: Почтовый адрес, на который будет отправляться сообщение. Если нужно указать нескольких получателей, то вводите адреса почты через запятую. Пример: «webmaster@example.com, sales@example.com, support@example.com».

source: A contact form with category %category already exists.
ru: Категория «%category» существует.

source: Category %category has been saved.
ru: Категория «%category» существует. Введите уникальное название.

source: contact
ru: Контакт

source: Send message
ru: Отправить

source: The Contact module allows visitors to contact site administrators and other users. Users specify a subject, write their message, and can have a copy of their message sent to their own e-mail address. For more information, see the online handbook entry for <a href="@contact">Contact module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/contact">Contact</a> позволяет посетителям сайта отправлять сообщения администрации, пользуясь контактной формой сайта, или другим пользователям, пользуясь персональными контактными формами пользователей. Форма отправки сообщения содержит поля для ввода заголовка, содержания и отметку для отправки копии на свой почтовый ящик.

source: User contact forms
ru: Персональные контактные формы

source: Site users can be contacted with a user contact form that keeps their e-mail address private. Users may enable or disable their personal contact forms by editing their <em>My account</em> page. If enabled, a <em>Contact</em> tab leads to a personal contact form displayed on their user profile. Site administrators are still able to use the contact form, even if has been disabled. The <em>Contact</em> tab is not shown when you view your own profile.
ru: Пользователи могут связываться с другими пользователями пользуясь своими персональными контактными формами, что позволяет скрывать почтовые адреса пользователей. Пользователи могут самостоятельно включать или выключать свои персональные контактные формы на странице правки аккаунта. Если контактная форма включена, то на страницу профиля пользователя добавляется вкладка «Контакт», которая показывается пользователям с соответствующими правами. Администраторы сайта могут пользоваться персональной контактной формой пользователя вне зависимости от того, включил её пользователь или нет. При просмотре своего профиля, вкладка «Контакт» не показывается.

source: Site-wide contact forms
ru: Контактная форма сайта

source: The <a href="@contact">Contact page</a> provides a simple form for users with the <em>Use the site-wide contact form</em> permission to send comments, feedback, or other requests. You can create categories for directing the contact form messages to a set of defined recipients. Common categories for a business site, for example, might include "Website feedback" (messages are forwarded to website administrators) and "Product information" (messages are forwarded to members of the sales department). E-mail addresses defined within a category are not displayed publicly.
ru: Страница с контактной формой сайта доступна пользователям с правом «Доступ к контактной форме сайта» и позволяет отправлять администрации комментарии, отзывы и любые другие сообщения. Для направления сообщений определённого характера на определённые почтовые адреса, для контактной формы могут быть добавлены категории и определены получатели писем для каждой из категорий. Обычными категориями для бизнес-сайта, например, являются «Отзыв о сайте» (сообщения отправляются администрации сайта) и «Информация о товаре» (сообщения отправляются сотрудникам отдела продаж). Почтовые адреса определённые для каждой категории публично не показываются.

source: When the site-wide contact form is enabled, a link in the main <em>Navigation</em> menu is created, but the link is disabled by default. This menu link can be enabled on the <a href='@menu'>Menus administration page</a>.
ru: Когда контактная форма включена, для неё создаётся ссылка в меню навигации, но по умолчанию, она является включенной. Если вы хотите показывать эту ссылку на сайте и изменить её размещение, то это можно сделать на <a href='@menu'>странице меню</a>.

source: Customization
ru: Настройка

source: If you would like additional text to appear on the site-wide or personal contact page, use a block. You can create and edit blocks on the <a href="@blocks">Blocks administration page</a>.
ru: Для вывода дополнительной информации на странице с контактной формой, добавьте новый блок (ссылка «Добавить блок» на <a href="@blocks">странице блоков</a>), настройте параметры его вывода и разместите в нужном регионе.

source: Add one or more categories on this page to set up your site-wide <a href="@form">contact form</a>.
ru: Поле выбора категорий показывается на странице <a href="@form">контактной формы</a> сайта (если категорий несколько). Добавить категорию можно на этой странице, воспользовавшись ссылкой «Добавить категорию».

source: A <em>Contact</em> menu item (disabled by default) is added to the Navigation menu, which you can modify on the <a href="@menu-settings">Menus administration page</a>.
ru: В меню навигации <a href="@menu-settings">можно включить</a> пункт «Контакт» (по умолчанию выключен). На странице параметров этого пункта можно определить меню, в котором он должен выводиться и его положение относительно других ссылок этого меню.

source: If you would like additional text to appear on the site-wide contact page, use a block. You can create and edit blocks on the <a href="@blocks">Blocks administration page</a>.
ru: Для вывода дополнительной информации на странице с контактной формой, добавьте новый блок (ссылка «Добавить блок» на <a href="@blocks">странице блоков</a>), настройте параметры его вывода и разместите в нужном регионе.

source: Administer contact forms and contact form settings
ru: Управление контактными формами

source: Use the site-wide contact form
ru: Доступ к контактной форме сайта

source: Use users' personal contact forms
ru: Доступ к контактным формам пользователей

source: Allow other users to contact you via a <a href="@url">personal contact form</a> which keeps your e-mail address hidden. Note that some privileged users such as site administrators are still able to contact you even if you choose to disable this feature.
ru: Персональная <a href="@url">контактная форма</a> позволяет другим пользователям отправлять вам письма, при этом сохраняя ваш почтовый адрес скрытым. Отметьте, что администраторы сайта всегда смогут связаться с вами, даже если вы отключите свою контактную форму.

source: Enable the personal contact form by default for new users.
ru: Автоматически включать персональную контактную форму при регистрации

source: Changing this setting will not affect existing users.
ru: Это поле определяет статус персональных контактных форм новых пользователей. Параметры контактной формы существующих пользователей не изменятся.
