Repository: vitrud/wols
Catalog: modules/field/translations/modules-field.*.po
Languages: ru

source: %name: this field cannot hold more than @count values.
ru: Поле «%name» не может содержать больше <em>@count</em> значений.

source: Weight for row @number
ru: Вес строки @number

source: Add another item
ru: Добавить

source: Order
ru: Порядок

source: The Field module allows custom data fields to be defined for <em>entity</em> types (entities include content items, comments, user accounts, and taxonomy terms). The Field module takes care of storing, loading, editing, and rendering field data. Most users will not interact with the Field module directly, but will instead use the <a href="@field-ui-help">Field UI module</a> user interface. Module developers can use the Field API to make new entity types "fieldable" and thus allow fields to be attached to them. For more information, see the online handbook entry for <a href="@field">Field module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/field">Field</a> позволяет добавлять различным объектам (документам, пользователям, терминам и так далее) дополнительные поля и обрабатывать их сохранение, загрузку, редактирование и вывод. Большинство пользователей не взаимодействуют с модулем Field напрямую, для взаимодействия с этим модулем как правило используется модуль <a href="@field-ui-help">Field UI</a>, который реализует интерфейс взаимодействия с ним. Разработчики модулей могут использовать Field API для создания объектов, которые позволяют прикреплять к себе дополнительные поля и самих прикрепляемых полей.

source: Enabling field types
ru: Типы полей

source: The Field module provides the infrastructure for fields and field attachment; the field types and input widgets themselves are provided by additional modules. Some of the modules are required; the optional modules can be enabled from the <a href="@modules">Modules administration page</a>. Drupal core includes the following field type modules: Number (required), Text (required), List (required), Taxonomy (optional), Image (optional), and File (optional); the required Options module provides input widgets for other field modules. Additional fields and widgets may be provided by contributed modules, which you can find in the <a href="@contrib">contributed module section of Drupal.org</a>. Currently enabled field and input widget modules:
ru: Модуль Field предоставляет инфраструктуру для полей и прикрепляемых через них файлов, типы полей и виджеты ввода сами по себе реализуются дополнительными модулями. Некоторые из этих модулей являются обязательными, другие модули могут быть включена на <a href="@modules">странице модулей</a>. Стандартная сборка включает следующие модули, реализующие типы полей: Number, Text, List (обязательные) и Taxonomy, Image, File (необязательные). Обязательный модуля Options предоставляет виджеты ввода для других модулей. Дополнительные поля и виджеты могут быть реализованы и <a href="http://content-management-systems.info/drupal/project">дополнительными модулями</a>. В настоящее время включены следующие модули реализующие поля и виджеты:

source: Managing field data storage
ru: Хранение данных

source: Developers of field modules can either use the default <a href="@sql-store">Field SQL storage module</a> to store data for their fields, or a contributed or custom module developed using the <a href="@storage-api">field storage API</a>.
ru: Разработчики модулей могут использовать как стандартный модуль <a href="@sql-store">Field SQL storage</a>, для управления хранением данных своих полей, так и дополнительные модули или свой код на основе <a href="@storage-api">Field Storage API</a>.

source: This function can only be used to delete fields without data
ru: Эта функция может использоваться только для удаления полей без данных.
