Repository: vitrud/wols
Catalog: modules/help/translations/modules-help.*.po
Languages: ru

source: Help topics
ru: Разделы справки

source: Help is available on the following items:
ru: Доступны следующие пункты:

source: No help is available for module %module.
ru: Для модуля %module справка недоступна.

source: @module administration pages
ru: Управление модулем @module

source: <strong>Configure your website</strong> Once logged in, visit the <a href="@admin">administration section</a>, where you can <a href="@config">customize and configure</a> all aspects of your website.
ru: <strong>Определите основные параметры</strong> После входа в аккаунт, перейдите в <a href="@admin">раздел управления</a>, в котором вы можете определить <a href="@config">основные параметры</a> сайта.

source: <strong>Enable additional functionality</strong> Next, visit the <a href="@modules">module list</a> and enable features which suit your specific needs. You can find additional modules in the <a href="@download_modules">Drupal modules download section</a>.
ru: <strong>Включите дополнительные возможности</strong> Перейдите на <a href="@modules">страницу модулей</a> и включите те из них, которые вы планируете использовать на своём сайте. Кроме этого, вы можете посмотреть <a href="http://content-management-systems.info/drupal/project">дополнительные модули</a> в сетевом руководстве и скачать нужные вам.

source: <strong>Customize your website design</strong> To change the "look and feel" of your website, visit the <a href="@themes">themes section</a>. You may choose from one of the included themes or download additional themes from the <a href="@download_themes">Drupal themes download section</a>.
ru: <strong>Настройте оформление сайта</strong> Для того, чтобы изменить оформление своего сайта, вам нужно перейти на <a href="@themes">страницу тем</a>. Вы можете выбрать одну из включённых в стандартную сборку тем или скачать <a href="@download_themes">дополнительные темы</a>.

source: Follow these steps to set up and start using your website:
ru: Для того, чтобы начать пользоваться сайтом, сделайте нужные шаги в следующей последовательности:

source: <strong>Start posting content</strong> Finally, you can <a href="@content">add new content</a> for your website.
ru: <strong>Добавьте на сайт содержание</strong> И наконец, вы можете приступить к <a href="@content">созданию содержания</a> своего сайта.

source: For more information, refer to the specific topics listed in the next section or to the <a href="@handbook">online Drupal handbooks</a>. You may also post at the <a href="@forum">Drupal forum</a> or view the wide range of <a href="@support">other support options</a> available.
ru: Дополнительную информацию можно найти на <a href="/admin/help">странице справки</a> системы или в <a href="http://content-management-systems.info/">сетевом руководстве</a>. Перевод: Сетегном.

source: The Help module provides <a href="@help-page">Help reference pages</a> and context-sensitive advice to guide you through the use and configuration of modules. It is a starting point for the online <a href="@handbook">Drupal handbooks</a>. The handbooks contain more extensive and up-to-date information, are annotated with user-contributed comments, and serve as the definitive reference point for all Drupal documentation. For more information, see the online handbook entry for the <a href="@help">Help module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/help">Help</a> позволяет создавать справочные страницы (такие, как эта), а также показывать контекстную справку на страницах управления сайтом. Это краткая версия <a href="http://content-management-systems.info/drupal">сетевого руководства</a>, которая включена в систему. Сетевое руководство содержит большее количество справочных страниц, комментарии добавленные пользователями и служит основным местом сбора документации по системе.

source: Providing a help reference
ru: Справочные страницы

source: The Help module displays explanations for using each module listed on the main <a href="@help">Help reference page</a>.
ru: Для каждого модуля включенного на сайте модуль показывает свою <a href="@help">справочную страницу</a>. Справочные страницы есть для всех стандартных модулей. Многие дополнительные также содержат свои справочные страницы.

source: Providing context-sensitive help
ru: Контекстная справка

source: The Help module displays context-sensitive advice and explanations on various pages.
ru: Модуль может показывать контекстную справку на различных страницах в блоке «Справка системы», который можно выводить в удобном для вас регионе темы.

source: Reference for usage, configuration, and modules.
ru: Справочная информация по возможностям и настройке различных модулей.
