Repository: vitrud/wols
Catalog: modules/simpletest/translations/modules-simpletest.*.po
Languages: ru

source: Value @value is TRUE.
ru: Значение @value: ИСТИНА.

source: Value @value is FALSE.
ru: Значение @value: ЛОЖЬ.

source: Value @value is NULL.
ru: Значение @value: NULL.

source: Value @value is not NULL.
ru: Значение @value: не NULL.

source: Role
ru: Роль

source: Username field found.
ru: Поле логина найдено.

source: Logout
ru: Выход

source: Password field found.
ru: Поле пароля найдено.

source: Current URL is @url.
ru: Текущий адрес: @url.

source: Email:
ru: Почта:

source: 1 e-mail was sent during this test.
ru: 1 письмо отправлено в процессе теста.

source: Tests
ru: Тесты

source: Select the test(s) or test group(s) you would like to run, and click <em>Run tests</em>.
ru: Выберите тест или группу тестов, которые нужно выполнить.

source: Run tests
ru: Старт

source: Clean test environment
ru: Очистка окружения

source: Remove tables with the prefix "simpletest" and temporary directories that are left over from tests that crashed. This is intended for developers when creating tests.
ru: Удаление таблиц с префиксом {simpletest_} и временных папок, которые остались от неудачно завершённых тестов. Это нужно разработчикам, создающим тесты.

source: Clean environment
ru: Очистка окружения

source: Test
ru: Тест

source: Expand
ru: Развернуть

source: Group
ru: Группа

source: Filename
ru: Имя файла

source: Line
ru: Строка

source: Function
ru: Функция

source: Pass
ru: Пройдено

source: Fail
ru: Ошибка

source: Debug
ru: Исправление неполадок

source: General
ru: Информация

source: Clear results after each complete test suite run
ru: Очищать результаты после каждого запуска тестирования

source: By default SimpleTest will clear the results after they have been viewed on the results page, but in some cases it may be useful to leave the results in the database. The results can then be viewed at <em>admin/config/development/testing/[test_id]</em>. The test ID can be found in the database, simpletest table, or kept track of when viewing the results the first time. Additionally, some modules may provide more analysis or features that require this setting to be disabled.
ru: Стандартно, результаты тестирования выводятся только на информационную страницу после завершения тестов и не сохраняются. Но иногда эту информацию может быть нужно сохранять. При сохранении результатов тестирования, их можно найти на страницах «admin/config/development/testing/[test_id]». Номер тестирования может быть найден в таблице базы данных {simpletest} или ссылка на страницу может быть сохранена в браузере, когда после прохождения тестирования будет открыта страница с результатами. Кроме того, некоторые модули могут предоставлять больше аналитической информации или возможностей, что потребует выключения этого параметра.

source: Provide verbose information when running tests
ru: Выводить подробную информацию при тестировании

source: The verbose data will be printed along with the standard assertions and is useful for debugging. The verbose data will be erased between each test suite run. The verbose data output is very detailed and should only be used when debugging.
ru: Подробная информация будет добавлена к стандартному выводу результатов тестирования. Эта информация удобна при отладке. Подробная информация удаляется между каждым запуском тестирования. Эта информация очень подробная и должна использоваться только при отладке.

source: HTTP authentication
ru: ХТТП-идентификация

source: HTTP auth settings to be used by the SimpleTest browser during testing. Useful when the site requires basic HTTP authentication.
ru: ХТТП-идентификация используется в процессе тестирования. Эти параметры могут потребоваться в том случае, если сайт требует прохождение базовой ХТТП-идентификации.

source: Method
ru: Способ

source: Basic
ru: Базовый

source: Digest
ru: Безопасный

source: GSS negotiate
ru: GSS

source: Any
ru: Любой

source: Any safe
ru: Любой безопасный

source: Use the <em>Clean environment</em> button to clean-up temporary files and tables.
ru: Для очистки таблиц и временные файлов, используйте кнопку «Очистка окружения».

source: No leftover tables to remove.
ru: Тестовых таблиц нет.

source: No temporary directories to remove.
ru: Временных папок нет.

source: 1 fail
ru: 1 ошибка

source: Removed 1 test result.
ru: 1 результат теста удалён.

source: Removed 1 leftover table.
ru: 1 тестовая таблица удалена.

source: Removed 1 temporary directory.
ru: 1 временная папка удалена.

source: Run tests against Drupal core and your active modules. These tests help assure that your site code is working as designed.
ru: Запуск тестов для стандартных и дополнительных модулей. Тесты помогают убедиться, что код не содержит ошибок и сайт работает правильно.

source: Not found
ru: Не найдено

source: The testing framework could not be installed because the PHP <a href="@curl_url">cURL</a> library is not available.
ru: Модуль Testing не включен, так как библиотека PHP <a href="@curl_url">cURL</a> не найдена.

source: The testing framework could not be installed because the PHP <a href="@hash_url">hash</a> extension is disabled.
ru: Модуль Testing не включен, так как расширение ПХП <a href="@curl_url">hash</a> не включено.

source: Enabled modules: %modules
ru: Включенные модули: %modules
