Repository: vitrud/wols
Catalog: modules/node/translations/modules-node.*.po
Languages: ru

source: Submission form settings
ru: Настройка форм

source: Title field label
ru: Заголовок поля «Название»

source: Explanation or submission guidelines
ru: Справка

source: Default options
ru: Выбор параметров

source: Save content type
ru: Сохранить тип

source: Delete content type
ru: Удалить

source: The human-readable name %name is already taken.
ru: Название «%name» уже используется.

source: The content type %name has been updated.
ru: Тип документа «%name» обновлён.

source: The content type %name has been added.
ru: Тип документа «%name» добавлен.

source: Are you sure you want to delete the content type %type?
ru: Удаление типа документов «%type»

source: The content type %name has been deleted.
ru: Тип документа «%name» удалён.

source: node
ru: документ

source: Added content type %name.
ru: Добавлен тип документов %name.

source: Deleted content type %name.
ru: Удаление типа документов «%name».

source: Are you sure you want to rebuild the permissions on site content?
ru: Переопределение прав доступа

source: This action rebuilds all permissions on site content, and may be a lengthy process. This action cannot be undone.
ru: <p>Это действие переопределит права доступа. Отметьте: переопределение прав может занять продолжительное время. Это действие нельзя отменить.</p>

source: published
ru: опубликован

source: not published
ru: не опубликован

source: promoted
ru: выведен на первую страницу

source: not promoted
ru: не выведен на первую страницу

source: sticky
ru: закреплён вверху списков

source: not sticky
ru: не закреплён вверху списков

source: Up to date translation
ru: перевод актуален

source: Outdated translation
ru: перевод устарел

source: type
ru: Тип

source: language
ru: язык

source: Show only items where
ru: Показать документы у которых

source: The update has encountered an error.
ru: При обновлении произошла ошибка.

source: An error occurred and processing did not complete.
ru: При обновлении документов произошла ошибка.

source: No items selected.
ru: Пункты не выбраны.

source: 1 item successfully processed:
ru: 1 пункт обработан:

source: Create @name
ru: Создание документа «@name»

source: Revision information
ru: Версия

source: Authoring information
ru: Автор

source: The trimmed version of your post shows what your post looks like when promoted to the main page or when exported for syndication.<span class="no-js"> You can insert the delimiter "&lt;!--break--&gt;" (without the quotes) to fine-tune where your post gets split.</span>
ru: Краткая версия документа показывается на обзорных страницах и в РСС-лентах. <span class="no-js">Для настройки краткой версии можно использовать разделитель &lt;!--break--&gt;</span>.

source: Preview trimmed version
ru: Краткая версия

source: Preview full version
ru: Полная версия

source: @type %title has been created.
ru: Документ «%title» создан.

source: @type %title has been updated.
ru: Документ «%title» обновлён.

source: Are you sure you want to delete %title?
ru: Удаление документа «%title»

source: Revisions for %title
ru: Версии документа «%title»

source: Revision
ru: Версия

source: !date by !username
ru: !username <br /> !date

source: current revision
ru: текущая версия

source: Are you sure you want to revert to the revision from %revision-date?
ru: Восстановление версии от %revision-date

source: Copy of the revision from %date.
ru: Копия версии от %date.

source: @type %title has been reverted back to the revision from %revision-date.
ru: Документ «%title» (тип «@type») восстановлен из версии от %revision-date.

source: Are you sure you want to delete the revision from %revision-date?
ru: Удаление версии от %revision-date

source: Revision from %revision-date of @type %title has been deleted.
ru: Версия документа «%title» (тип «@type») от %revision-date удалена.

source: @type: updated %title.
ru: @type: обновлён документ «%title».

source: @type: reverted %title revision %revision.
ru: Документ «%title» (тип @type) восстановлен из версии от %revision.

source: @type: deleted %title revision %revision.
ru: @type: Версия %revision документа «%title» удалена.

source: The content access permissions need to be rebuilt.
ru: Права доступа к содержанию нуждаются в переопределении.

source: The username %name does not exist.
ru: Логин %name не существует.

source: @type %title has been deleted.
ru: Документ «%title» (тип документа «@type») удалён.

source: Revision of %title from %date
ru: Версия документа «%title» от %date

source: Content ranking
ru: Рейтинг

source: The following numbers control which properties the content search should favor when ordering the results. Higher numbers mean more influence, zero means the property is ignored. Changing these numbers does not require the search index to be rebuilt. Changes take effect immediately.
ru: Следующие факторы влияют на порядок выдачи результатов поиска. Большее значение означает больший вес этого фактора, ноль означает, что данный фактор должен игнорироваться. Изменение этих значений не требует перестройки индекса и новые значения применяются сразу же.

source: Keyword relevance
ru: Соответствие знакам использованным в запросе

source: Recently posted
ru: Дата создания

source: Factor
ru: Фактор

source: Syndicate
ru: Лента сайта

source: RSS
ru: РСС

source: Advanced search
ru: Расширенный поиск

source: Containing any of the words
ru: Содержатся слова

source: Containing the phrase
ru: Точная фраза

source: Containing none of the words
ru: Не содержатся слова

source: Only of the type(s)
ru: Типы документов

source: Rebuilding content access permissions
ru: Переопределение прав доступа

source: Content permissions have been rebuilt.
ru: Права переопределены.

source: The content access permissions have been rebuilt.
ru: Права доступа к содержанию переопределены.

source: The username of the user to which you would like to assign ownership.
ru: Выберите пользователя который будет указан в качестве автора.

source: @type: deleted %title.
ru: @type: удалён «%title».

source: Content types
ru: Типы документов

source: Add content type
ru: Добавить тип

source: Revisions
ru: Версии

source: Delete earlier revision
ru: Удалить ранние версии

source: manage fields
ru: Поля

source: manage display
ru: Показ

source: No content types available. <a href="@link">Add content type</a>.
ru: Типов документов нет.

source: The human-readable name of this content type. This text will be displayed as part of the list on the <em>Add new content</em> page. It is recommended that this name begin with a capital letter and contain only letters, numbers, and spaces. This name must be unique.
ru: Название типа документа должно быть уникальным.

source: A unique machine-readable name for this content type. It must only contain lowercase letters, numbers, and underscores. This name will be used for constructing the URL of the %node-add page, in which underscores will be converted into hyphens.
ru: Системное название этого типа документов. Содержание этого поля будет использоваться для создания УРЛ при создании и редактировании документа этого типа. Знак подчёркивания будет заменён дефисом. Название может содержать только латинские буквы нижнего регистра, цифры и знак подчёркивания.

source: Describe this content type. The text will be displayed on the <em>Add new content</em> page.
ru: Описание документа показывается на странице добавления/правки документа и странице типов документов.

source: Preview before submitting
ru: Просмотр перед сохранением

source: This text will be displayed at the top of the page when creating or editing content of this type.
ru: Содержание этого поля будет показываться вверху страницы добавления и правки документа этого типа. Вы можете использовать справку для информирования пользователей о правилах добавления документов.

source: Users with the <em>Administer content</em> permission will be able to override these options.
ru: Пользователям с правом «Управление документами» доступно изменение этих параметров.

source: Display settings
ru: Параметры вывода

source: Display author and date information.
ru: Показывать автора и дату создания документа

source: Author username and publish date will be displayed.
ru: В документе будет показываться информация об авторе и дате создания документа.

source: Publish selected content
ru: Опубликовать

source: Unpublish selected content
ru: Отменить публикацию

source: Promote selected content to front page
ru: Вывести на первую страницу

source: Demote selected content from front page
ru: Отменить вывод на первую страницу

source: Make selected content sticky
ru: Закрепить вверху списков

source: Make selected content not sticky
ru: Отменить закрепление вверху списков

source: Delete selected content
ru: Удалить

source: where %property is %value
ru: %property — %value

source: Undefined language (@langcode)
ru: Неопределённый язык (@langcode)

source: Deleted @count posts.
ru: Удалённые документы: @count.

source: <em>Edit @type</em> @title
ru: @title

source: Revision log message
ru: Примечание

source: Provide an explanation of the changes you are making. This will help other authors understand your motivations.
ru: Пояснение о внесённых в изменениях, которое поможет другим пользователям понять ваши действия.

source: Format: %time. The date format is YYYY-MM-DD and %timezone is the time zone offset from UTC. Leave blank to use the time of form submission.
ru: <ul> <li>Формат даты: %time</li> <li>Если хотите, чтобы использовалось текущее время, оставьте это поле незаполненным</li> </ul>

source: Nodes
ru: Документы

source: Content ID
ru: Номер документа

source: Revision ID
ru: Номер версии

source: Content type
ru: Тип документа

source: The type of the node.
ru: Тип документа.

source: Content type name
ru: Тип

source: The human-readable name of the node type.
ru: Название типа документа должно быть уникальным.

source: The title of the node.
ru: Заголовок документа.

source: The main body text of the node.
ru: Полное содержание документа.

source: The summary of the node's main body text.
ru: Краткое содержание документа.

source: The language the node is written in.
ru: Язык документа.

source: The URL of the node.
ru: Адрес документа.

source: The date the node was posted.
ru: Дата создания документа.

source: The Node module manages the creation, editing, deletion, settings, and display of the main site content. Content items managed by the Node module are typically displayed as pages on your site, and include a title, some meta-data (author, creation time, content type, etc.), and optional fields containing text or other data (fields are managed by the <a href="@field">Field module</a>). For more information, see the online handbook entry for <a href="@node">Node module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/node">Node</a> управляет созданием, правкой, удалением, параметрами и выводом документов сайта. Пункты документа управляются этим модулем и показываются на сайте как страницы, которые включают заголовок, мета-данные (автора, дату создания, тип документа и так далее), дополнительные поля содержащие текст или другие данные (поля управляются модулем <a href="@field">Field</a>).

source: Creating content
ru: Добавление документов

source: When new content is created, the Node module records basic information about the content, including the author, date of creation, and the <a href="@content-type">Content type</a>. It also manages the <em>publishing options</em>, which define whether or not the content is published, promoted to the front page of the site, and/or sticky at the top of content lists. Default settings can be configured for each <a href="@content-type">type of content</a> on your site.
ru: Когда добавляется новый документ, то модуль Node записывает основную информацию о документе, включая автора, дату создания и <a href="@content-type">тип документа</a>. Он также управляет параметрами публикации, которые определяют будет или нет документ опубликован, будет ли он выведен на первую страницу сайта и(или) закреплён вверху списков с документами. Параметры, которые будут использоваться по умолчанию, можно настроить отдельно для каждого <a href="@content-type">типа документов</a>.

source: Creating custom content types
ru: Добавление типов документов

source: The Node module gives users with the <em>Administer content types</em> permission the ability to <a href="@content-new">create new content types</a> in addition to the default ones already configured. Creating custom content types allows you the flexibility to add <a href="@field">fields</a> and configure default settings that suit the differing needs of various site content.
ru: Пользователи с правом «Управление типами документов» <a href="@content-new">могут добавлять</a> новые типы, удалять и редактировать параметры существующих типов. Добавление новых типов документов позволяет гибко настроить <a href="@field">поля</a> и различные параметры, которые используются для различного содержания сайта.

source: Administering content
ru: Управление документами

source: The <a href="@content">Content administration page</a> allows you to review and bulk manage your site content.
ru: <a href="@content">Страница документов</a> позволяет просматривать имеющиеся на сайте документы и выполнять с ними групповые операции.

source: Creating revisions
ru: Запись версий

source: The Node module also enables you to create multiple versions of any content, and revert to older versions using the <em>Revision information</em> settings.
ru: Модуль позволяет записывать версии документов, возвращаться к старым версия используя параметры секции «Версия». Если у документа есть несколько версий, то для таких документов показывается вкладка «Версии».

source: User permissions
ru: Права пользователей

source: The Node module makes a number of permissions available for each content type, which can be set by role on the <a href="@permissions">permissions page</a>.
ru: Для каждого типа документов генерируется свой набор прав, которые можно настроить на <a href="@permissions">странице прав</a>.

source: Individual content types can have different fields, behaviors, and permissions assigned to them.
ru: Каждый тип документа может иметь свой набор различных полей, параметров и связанных с ними прав.

source: Content items can be displayed using different view modes: Teaser, Full content, Print, RSS, etc. <em>Teaser</em> is a short format that is typically used in lists of multiple content items. <em>Full content</em> is typically used when the content is displayed on its own page.
ru: Пункты содержания могут показываться различными способами: краткое содержание (используется на обзорных страницах), полное содержание (используется, когда открыта страница самого документа), версия для печати (для печати содержания документа на бумаге), РСС-лента (для распространения содержания используя технологию РСС) и так далее.

source: Here, you can define which fields are shown and hidden when %type content is displayed in each view mode, and define how the fields are displayed in each view mode.
ru: Для типа документов «%type» можно настроить, какие поля будут показываться при использовании определённого способа вывода. Кроме того, для каждого способа вывода можно настроить и то, каким образом будет выводится используемое в нём поле.

source: Revisions allow you to track differences between multiple versions of your content, and revert back to older versions.
ru: Версии позволяют отслеживать изменения вносимые в документ.

source: Full content
ru: Полное содержание

source: Teaser
ru: Краткое содержание

source: Node module element
ru: Элемент модуля Node

source: Bypass content access control
ru: Просмотр, правка и удаление всех документов

source: View, edit and delete all content regardless of permission restrictions.
ru: Просмотр, правка и удаление всех документов сайта, невзирая на другие ограничения в правах.

source: Administer content types
ru: Управление типами документов

source: Administer content
ru: Управление документами

source: Access the content overview page
ru: Просмотр обзорных страниц

source: View published content
ru: Просмотр документов

source: View own unpublished content
ru: Просмотр своих неопубликованных документов

source: View content revisions
ru: Просмотр версий документов

source: Revert content revisions
ru: Восстановление версий документов

source: Delete content revisions
ru: Удаление версий документов

source: Content is sticky at top of lists
ru: Документ закреплён вверху списков

source: Content is promoted to the front page
ru: Документ выведен на первую страницу

source: Number of recent content items to display
ru: Пункты

source: Show block for specific content types
ru: Типы документов

source: Show this block only on pages that display content of the given type(s). If you select no types, there will be no type-specific limitation.
ru: Выберите типы документов, на страницах которых будет разрешён вывод этого блока. Если ограничивать видимость блока на основе типа документов не нужно, то оставьте все поля неотмеченными.

source: Welcome to @site-name
ru: Добро пожаловать на сайт «@site-name»!

source: No front page content has been created yet.
ru: На первую страницу сайта документы не выводились.

source: %type_name: Create new content
ru: %type_name: добавление новых документов

source: %type_name: Edit own content
ru: %type_name: правка своих документов

source: %type_name: Edit any content
ru: %type_name: правка всех документов

source: %type_name: Delete own content
ru: %type_name: удаление своих документов

source: %type_name: Delete any content
ru: %type_name: удаление всех документов

source: Publish content
ru: Опубликовать документ

source: Unpublish content
ru: Отменить публикацию документа

source: Make content sticky
ru: Закрепить документ вверху списков

source: Make content unsticky
ru: Отменить закрепление документа вверху списков

source: Promote content to front page
ru: Вывести документ на первую страницу

source: Change the author of content
ru: Изменить автора документа

source: Save content
ru: Сохранить документ

source: Unpublish content containing keyword(s)
ru: Отменить публикацию документа содержащего слова

source: The content will be unpublished if it contains any of the phrases above. Use a case-sensitive, comma-separated list of phrases. Example: funny, bungee jumping, "Company, Inc."
ru: Публикация документа будет отменена, если в его содержании будет найдено хотя бы одно слово из списка. Вводите слова разделяя их запятыми. Учитывается регистр введённых знаков.

source: If the site is experiencing problems with permissions to content, you may have to rebuild the permissions cache. Rebuilding will remove all privileges to content and replace them with permissions based on the current modules and settings. Rebuilding may take some time if there is a lot of content or complex permission settings. After rebuilding has completed, content will automatically use the new permissions.
ru: Если на вашем сайте наблюдаются проблемы с доступом к документам, вы можете перестроить кеш прав. Существующие проблемы могут быть вызваны выключением определённых модулей или изменениями прав. Перестройка прав удалит все разрешения на доступ к документам и заменит их значениями основанными на текущих включенных модулях и выставленных параметрах. Отметьте: эта операция может занять продолжительное время. Кроме того, операция может быть не закончена, если в документах присутствуют возможности, которые должны обеспечиваться модулями, которые были удалены.

source: Manage content types, including default status, front page promotion, comment settings, etc.
ru: Управление типами документов: статусом, выводом на первую страницу, параметрами комментирования и так далее.

source: Requires a title
ru: Необходим заголовок

source: Don't display post information
ru: Не показывать автора и дату

source: New revision
ru: Новая версия

source: No revision
ru: Версий нет

source: By @name on @date
ru: @name. @date

source: By @name
ru: Автор: @name

source: (Machine name: @type)
ru: (Системное название: @type)
