Repository: vitrud/wols
Catalog: modules/user/translations/modules-user.*.po
Languages: ru

source: KB
ru: КБ

source: Strong
ru: Сильная

source: Created
ru: Создано

source: The name used to indicate anonymous users.
ru: Имя которое будет использоваться для обозначения <em>анонимных посетителей</em>.

source: Show only users where
ru: Показать пользователей у которых

source: Last access
ru: Доступ

source: No users selected.
ru: Пользователи не выбраны.

source: Notify user when account is activated.
ru: Отправить оповещение об активировании аккаунта

source: Notify user when account is blocked.
ru: Отправить оповещение о блокировании аккаунта

source: Default picture
ru: Изображение

source: URL of picture to display for users with no custom picture selected. Leave blank for none.
ru: Введите УРЛ изображения, которое будет использоваться для пользователей по умолчанию. Можно использовать как абсолютный, так и относительный адрес. Если вы не хотите использовать изображение по умолчанию, то не заполняйте это поле.

source: Picture guidelines
ru: Справка

source: This text is displayed at the picture upload form in addition to the default guidelines. It's useful for helping or instructing your users.
ru: Содержание этого поля будет показываться в форме загрузке изображений. Его можно использовать для указания инструкций пользователям или публикации правил использования изображений на сайте.

source: Save permissions
ru: Сохранить

source: @module module
ru: @module

source: Permission
ru: Право

source: Role name
ru: Название

source: The name for this role. Example: "moderator", "editorial board", "site architect".
ru: Введите название роли, например: «модератор», «редактор» и так далее.

source: Save role
ru: Сохранить роль

source: Add role
ru: Добавить роль

source: The role has been renamed.
ru: Роль обновлена.

source: The role has been deleted.
ru: Роль удалена.

source: The role has been added.
ru: Роль добавлена.

source: edit permissions
ru: изменить права

source: edit role
ru: правка

source: Username or e-mail address
ru: Логин или почта

source: E-mail new password
ru: Отправить письмо

source: Sorry, %name is not recognized as a user name or an e-mail address.
ru: Запись «%name» не найдена среди имён пользователей и почтовых адресов.

source: Further instructions have been sent to your e-mail address.
ru: Дальнейшие инструкции отправлены на указанный почтовый адрес.

source: You have tried to use a one-time login link that has expired. Please request a new one using the form below.
ru: Вы пытаетесь воспользоваться одноразовой ссылкой, срок действия которой уже истёк. Для того, чтобы получить новую ссылку, воспользуйтесь функцией восстановления пароля.

source: This login can be used only once.
ru: Вход в аккаунт с использованием этой ссылки может быть выполнен только один раз.

source: %name has been deleted.
ru: Документ «%title» удалён.

source: Password reset instructions mailed to %name at %email.
ru: Пароль и дальнейшие инструкции отправлены пользователю %name на почтовый адрес %email.

source: Session closed for %name.
ru: Сессия пользователя «%name» закрыта.

source: You must enter a username.
ru: Введите логин.

source: The username cannot begin with a space.
ru: Логин не может начинаться с пробела.

source: The username cannot end with a space.
ru: Логин не может заканчиваться пробелом.

source: The username cannot contain multiple spaces in a row.
ru: Логин не может содержать несколько пробелов подряд.

source: The username contains an illegal character.
ru: Логин содержит запрещённый знак.

source: The username %name is too long: it must be %max characters or less.
ru: Логин %name слишком длинный. Логин не может состоять более чем из %max знаков.

source: You must enter an e-mail address.
ru: Введите почтовый адрес.

source: The e-mail address %mail is not valid.
ru: Почтовый адрес %mail некорректен.

source: Failed to upload the picture image; the %directory directory doesn't exist or is not writable.
ru: При загрузке изображения произошла ошибка. Папки %directory не существует или она недоступны для записи.

source: History
ru: История

source: Account settings
ru: Настройка аккаунта

source: Create a new user account.
ru: Создание аккаунта

source: Request new password
ru: Восстановить пароль

source: Request new password via e-mail.
ru: Восстановление пароля

source: Who's new
ru: Новые пользователи

source: Who's online
ru: Сейчас на сайте

source: Number of users to display
ru: Пользователи

source: User activity
ru: Активность пользователя

source: A user is considered online for this long after they have last viewed a page.
ru: Время, в течение которого пользователь считается находящимся на сайте с тех пор, как он в последний раз просмотрел какую-либо страницу.

source: User list length
ru: Пользователей в списке

source: Maximum number of currently online users to display.
ru: Выберите максимальное количество пользователей, которые будут показываться в списке блока. Например, если выбрано значение «100», а на сайте находится 150 пользователей, то в блоке будут показаны только псевдонимы последних 100 пользователей, совершивших какое-либо действие в течение периода, определённого в поле «Активность пользователя».

source: @user's picture
ru: Изображение пользователя @user

source: My account
ru: Мой аккаунт

source: Enter your @s username.
ru: Введите свой логин.

source: Enter the password that accompanies your username.
ru: Введите свой пароль.

source: The username %name has not been activated or is blocked.
ru: Логин «%name» не активирован или блокирован.

source: Sorry, unrecognized username or password. <a href="@password">Have you forgotten your password?</a>
ru: Логин или пароль введены неверно (<a href="@password">восстановление пароля</a>).

source: A valid e-mail address. All e-mails from the system will be sent to this address. The e-mail address is not made public and will only be used if you wish to receive a new password or wish to receive certain news or notifications by e-mail.
ru: Почтовый адрес, на которой будут отправляться письма с сайта. Этот адрес не будет виден другим пользователям и используется для восстановления пароля, оповещений и связи через контактную форму.

source: To change the current user password, enter the new password in both fields.
ru: Для изменения текущего пароля, введите новый в оба поля.

source: Provide a password for the new account in both fields.
ru: Введите пароль в оба поля.

source: Blocked
ru: Блокирован

source: Signature settings
ru: Подпись

source: Signature
ru: Подпись

source: Your signature will be publicly displayed at the end of your comments.
ru: Содержание этого поля будет показываться под каждым вашим комментарием.

source: Picture
ru: Изображение

source: Delete picture
ru: Удалить

source: Check this box to delete your current picture.
ru: Отметьте это поле, чтобы удалить текущее изображение.

source: Upload picture
ru: Файл

source: The name %name is already taken.
ru: Логин «%name» занят.

source: The e-mail address %email is already registered. <a href="@password">Have you forgotten your password?</a>
ru: Почтовый адрес %email уже зарегистрирован. <a href="@password">Восстановить пароль</a>.

source: Unblock the selected users
ru: Разблокировать выбранных пользователей

source: Block the selected users
ru: Блокировать выбранных пользователей

source: Add a role to the selected users
ru: Включить выбранных пользователей в роль

source: Remove a role from the selected users
ru: Удалить выбранных пользователей из роли

source: This web page allows administrators to register new users. Users' e-mail addresses and usernames must be unique.
ru: Эта страница позволяет администраторам регистрировать новых пользователей. У каждого пользователя должен быть уникальный логин и почтовый адрес.

source: role
ru: роль

source: permission
ru: право

source: Password strength:
ru: Надёжность пароля:

source: Passwords match:
ru: Совпадение паролей:

source: Block current user
ru: Блокировать аккаунт текущего пользователя

source: Created a new user account for <a href="@url">%name</a>. No e-mail has been sent.
ru: Аккаунт «<a href="@url">%name</a>» создан. Оповещение не отправлено.

source: Registration successful. You are now logged in.
ru: Регистрация успешно завершена. В настоящее время вы находитесь в аккаунте.

source: Thank you for applying for an account. Your account is currently pending approval by the site administrator.<br />In the meantime, a welcome message with further instructions has been sent to your e-mail address.
ru: Аккаунт будет активирован после одобрения администратором.

source: Notify user of new account
ru: Отправить пользователю оповещение

source: Login attempt failed for %user.
ru: Неудачная попытка входа в аккаунт. Пользователь «%user».

source: Session opened for %name.
ru: Сессия пользователя «%name» октрыта.

source: Deleted user: %name %email.
ru: Пользователь «%name» (%email) удалён.

source: Blocked user %name.
ru: Пользователь «%name» блокирован.

source: New user: %name (%email).
ru: Новый пользователь: %name (почта — %email).

source: Reset password
ru: Восстановление пароля

source: Add user
ru: Добавить пользователя

source: Determine access to features by selecting permissions for roles.
ru: Определение прав доступа к возможностям модулей на основании ролей.

source: List, edit, or add user roles.
ru: Просмотр списка ролей. Добавление, правка и удаление ролей.

source: Edit role
ru: Правка роли

source: Account
ru: Аккаунт

source: anonymous user
ru: посетитель

source: authenticated user
ru: пользователь

source: %property is %value
ru: %property = %value

source: No people available.
ru: Пользователей нет.

source: Anonymous users
ru: Анонимные посетители

source: Administrator role
ru: Роль администраторов

source: This role will be automatically assigned new permissions whenever a module is enabled. Changing this setting will not affect existing permissions.
ru: Пользователям этой роли будут автоматически назначаться все возможные права модуля, когда включается любой модуль. Изменение этого поля не окажет влияния на существующие права.

source: Registration and cancellation
ru: Регистрация и удаление

source: Who can register accounts?
ru: Регистрация

source: Administrators only
ru: Администратор

source: Visitors
ru: Посетитель

source: Visitors, but administrator approval is required
ru: Посетитель, но требуется подтверждение администратора

source: Require e-mail verification when a visitor creates an account.
ru: Требуется подтверждение почтового адреса

source: New users will be required to validate their e-mail address prior to logging into the site, and will be assigned a system-generated password. With this setting disabled, users will be logged in immediately upon registering, and may select their own passwords during registration.
ru: Отметьте это поле, если хотите чтобы на указанный почтовый адрес отправлялось письмо с паролем от аккаунта и ссылкой для подтверждения регистрации. Если это поле не отмечено, то от пользователя не будет требоваться подтверждение почтового адреса, он сможет сразу ввести пароль и войти в аккаунт.

source: When cancelling a user account
ru: Удаление

source: Users with the %select-cancel-method or %administer-users <a href="@permissions-url">permissions</a> can override this default method.
ru: Пользователи с правом «%select-cancel-method» или «%administer-users» <a href="@permissions-url">могут изменять</a> способ удаления аккаунта.

source: Select method for cancelling account
ru: Выберите способ удаления аккаунта

source: Personalization
ru: Параметры аккаунта

source: Enable signatures.
ru: Подписи

source: The directory %directory does not exist or is not writable.
ru: Папки %directory не существует или она недоступна для записи.

source: Enable user pictures.
ru: Аватары

source: Picture directory
ru: Папка

source: Subdirectory in the file upload directory where pictures will be stored.
ru: Введите название папки в которой будут храниться изображения. Эта папка будет создана в системной папке.

source: Picture display style
ru: Стиль вывода

source: The style selected will be used on display, while the original image is retained. Styles may be configured in the <a href="!url">Image styles</a> administration area.
ru: Выберите стиль, который будет использоваться для изображения профиля пользователя. Стили можно настроить на странице <a href="!url">Стили изображений</a>.

source: Picture upload dimensions
ru: Размер в пикселях

source: Pictures larger than this will be scaled down to this size.
ru: Максимальный размер изображения в пикселях. Изображения большего размера будут масштабированы к указанному.

source: Picture upload file size
ru: Размер в килобайтах

source: Maximum allowed file size for uploaded pictures. Upload size is normally limited only by the PHP maximum post and file upload settings, and images are automatically scaled down to the dimensions specified above.
ru: Максимальный размер изображения в килобайтах. Размер загружаемых файлов обычно ограничивается параметрами ПХП и параметрами загрузки файла.

source: E-mails
ru: Настройка оповещений

source: Available variables are: [site:name], [site:url], [user:name], [user:mail], [site:login-url], [site:url-brief], [user:edit-url], [user:one-time-login-url], [user:cancel-url].
ru: Доступные токены: <ul> <li>[site:name] — название сайта</li> <li>[site:url] — УРЛ сайта</li> <li>[site:url-brief] — домен сайта</li> <li>[site:login-url] — ссылка для входа в аккаунт</li> <li>[user:name] — логин пользователя</li> <li>[user:mail] — почта пользователя</li> <li>[user:edit-url] — страница правка аккаунта пользователя</li> <li>[user:one-time-login-url] — одноразовая ссылка для входа в аккаунт</li> <li>[user:cancel-url] — ссылка для удаления аккаунта</li> </ul>

source: Welcome (new user created by administrator)
ru: Регистрация: администратор

source: Edit the welcome e-mail messages sent to new member accounts created by an administrator.
ru: Сообщение, которое будет отправлено пользователю после регистрации, при выборе администратором параметра «Регистрация: администратор».

source: Welcome (awaiting approval)
ru: Регистрация: посетитель, подтверждение

source: Edit the welcome e-mail messages sent to new members upon registering, when administrative approval is required.
ru: Сообщение, которое будет отправлено пользователю после регистрации, при выборе администратором параметра «Регистрация: посетитель, но требуется подтверждение администратора».

source: Welcome (no approval required)
ru: Регистрация: посетитель

source: Edit the welcome e-mail messages sent to new members upon registering, when no administrator approval is required.
ru: Сообщение, которое будет отправлено пользователю после регистрации, при выборе администратором параметра «Регистрация: посетители».

source: Password recovery
ru: Восстановление пароля

source: Edit the e-mail messages sent to users who request a new password.
ru: Сообщение, которое будет отправлено пользователю при запросе нового пароля.

source: Account activation
ru: Аккаунт активирован

source: Enable and edit e-mail messages sent to users upon account activation (when an administrator activates an account of a user who has already registered, on a site where administrative approval is required).
ru: Сообщение, которое будет отправлено пользователю после активирования его аккаунта (когда администратор изменяет в аккаунте параметр «Статус», например, если для регистрации на сайте выбран параметр «Регистрация: посетитель, но требуется подтверждение администратора»).

source: Account blocked
ru: Аккаунт блокирован

source: Enable and edit e-mail messages sent to users when their accounts are blocked.
ru: Сообщение, которое будет отправлено пользователю после блокирования его аккаунта.

source: Account cancellation confirmation
ru: Удаление аккаунта: запрос на подтверждение

source: Edit the e-mail messages sent to users when they attempt to cancel their accounts.
ru: Сообщение, которое будет отправлено пользователю после запроса на удаление аккаунта.

source: Account canceled
ru: Удаление аккаунта: аккаунт удалён

source: Enable and edit e-mail messages sent to users when their accounts are canceled.
ru: Сообщение, которое будет отправлено пользователю после удаления его аккаунта.

source: Warning: Give to trusted roles only; this permission has security implications.
ru: Предупреждение: это право связано с безопасностью сайта. Предоставляйте это право только пользователям той роли, которым вы доверяете.

source: Save order
ru: Сохранить

source: The role settings have been updated.
ru: Параметры обновлены.

source: @name <em>(locked)</em>
ru: @name <em>(блокировано)</em>

source: The role name %name already exists. Choose another role name.
ru: Роль «%name» уже существует.

source: Are you sure you want to delete the role %name ?
ru: Удаление роли «%name»

source: You have just used your one-time login link. It is no longer necessary to use this link to log in. Please change your password.
ru: Вы только что воспользовались одноразовой ссылкой для входа в аккаунт. Больше нет никакой необходимости использовать эту ссылку. Введите пароль, который вы хотите использовать для входа в аккаунт в дальнейшем.

source: <p>This is a one-time login for %user_name and will expire on %expiration_date.</p><p>Click on this button to log in to the site and change your password.</p>
ru: <p>Это одноразовая ссылка для входа в аккаунт «%user_name». Возможность воспользоваться входом в аккаунт по этой ссылке истекает %expiration_date. Нажмите на кнопку «Войти», чтобы войти в свой аккаунт и изменить пароль.</p>

source: You have tried to use a one-time login link that has either been used or is no longer valid. Please request a new one using the form below.
ru: Вы пытаетесь воспользоваться одноразовой ссылкой, срок действия которой уже истёк. Для того, чтобы получить новую ссылку, воспользуйтесь функцией восстановления пароля.

source: Are you sure you want to cancel your account?
ru: Удаление аккаунта

source: Are you sure you want to cancel the account %name?
ru: Удаление аккаунта «%name»

source: Select the method to cancel the account above.
ru: Выберите способ удаления аккаунта.

source: A confirmation request to cancel your account has been sent to your e-mail address.
ru: Запрос на удаление аккаунта будет отправлен на указанный почтовый адрес.

source: Disable the account and keep its content.
ru: Блокировать аккаунт, оставить документы опубликованными

source: Your account will be blocked and you will no longer be able to log in. All of your content will remain attributed to your user name.
ru: Аккаунт блокирован и вы больше не сможете в него войти. Всё содержание останется на сайте под текущим именем пользователя.

source: Disable the account and unpublish its content.
ru: Блокировать аккаунт, отменить публикацию документов

source: Your account will be blocked and you will no longer be able to log in. All of your content will be hidden from everyone but administrators.
ru: Аккаунт блокирован и вы больше не сможете в него войти. Всё содержание будет скрыто ото всех пользователей, кроме администраторов сайта.

source: Delete the account and make its content belong to the %anonymous-name user.
ru: Удалить аккаунт, переместить документы в аккаунт «%anonymous-name»

source: Your account will be removed and all account information deleted. All of your content will be assigned to the %anonymous-name user.
ru: Аккаунт удалён. Всё содержание приписано пользователю «%anonymous-name».

source: Delete the account and its content.
ru: Удалить аккаунт, удалить документы

source: Your account will be removed and all account information deleted. All of your content will also be deleted.
ru: Аккаунт и всё добавленное через него содержание удалёны.

source: You have tried to use an account cancellation link that has expired. Please request a new one using the form below.
ru: Вы пытаетесь воспользоваться ссылкой для удаления аккаунта, срок действия которой уже истёк. Для того, чтобы получить новую ссылку, воспользуйтесь функцией восстановления пароля.

source: Current user
ru: Текущий пользователь

source: User ID
ru: Номер пользователя

source: The unique ID of the user account.
ru: Номер аккаунта.

source: The login name of the user account.
ru: Логин аккаунта.

source: The email address of the user account.
ru: Почта аккаунта.

source: The URL of the account profile page.
ru: Адрес страницы аккаунта.

source: The URL of the account edit page.
ru: Адрес страницы правки аккаунта.

source: Last login
ru: Последний вход в аккаунт

source: The date the user last logged in to the site.
ru: Дата последнего входа пользователя в аккаунт.

source: The date the user account was created.
ru: Дата создания аккаунта.

source: not yet assigned
ru: не назначено

source: not yet created
ru: не создано

source: The User module allows users to register, log in, and log out. It also allows users with proper permissions to manage user roles (used to classify users) and permissions associated with those roles. For more information, see the online handbook entry for <a href="@user">User module</a>.
ru: Модуль <a href="http://content-management-systems.info/drupal/project/user">User</a> позволяет регистрироваться на сайте и управляет аккаунтами. Он также позволяет пользователям с соответствующими правами управлять ролями пользователей (используется для классификации пользователей) и правами связанными с каждой ролью.

source: Creating and managing users
ru: Управление пользователями

source: The User module allows users with the appropriate <a href="@permissions">permissions</a> to create user accounts through the <a href="@people">People administration page</a>, where they can also assign users to one or more roles, and block or delete user accounts. If allowed, users without accounts (anonymous users) can create their own accounts on the <a href="@register">Create new account</a> page.
ru: Модуль User позволяет пользователям с <a href="@permissions">соответствующими правами</a> создавать аккаунты пользователей на <a href="@people">странице пользователей</a>. Пользователь может быть включён в ту или иную роль, его аккаунт может блокирован или удалён. Если разрешено, пользователи без аккаунтов (анонимные посетители) могут создавать свои аккаунты на <a href="@register">странице регистрации</a> на сайте.

source: User roles and permissions
ru: Роли и права
