Repository: vitrud/wols
Catalog: modules/user/translations/modules-user.*.po
Languages: ru

source: <em>Roles</em> are used to group and classify users; each user can be assigned one or more roles. By default there are two roles: <em>anonymous user</em> (users that are not logged in) and <em>authenticated user</em> (users that are registered and logged in). Depending on choices you made when you installed Drupal, the installation process may have defined more roles, and you can create additional custom roles on the <a href="@roles">Roles page</a>. After creating roles, you can set permissions for each role on the <a href="@permissions_user">Permissions page</a>. Granting a permission allows users who have been assigned a particular role to perform an action on the site, such as viewing a particular type of content, editing or creating content, administering settings for a particular module, or using a particular function of the site (such as search).
ru: Роли используются для группировки и классификации пользователей. Каждый пользователь может входить сразу в несколько ролей. По умолчанию на сайте всегда есть две роли: «анонимный посетитель» и «зарегистрированный пользователь». Эти роли являются системными и не могут быть удалены. Ролями можно управлять на <a href="@roles">странице ролей</a>. После добавления роли, вы можете настроить набор прав, которые будут доступны пользователям этой роли на <a href="@permissions_user">странице прав</a>. Предоставление пользователям прав позволяет им выполнять определённые действия, которые эти права разрешают, такие как просмотр документов, изменение типа документов, добавление документов, управление параметрами определённого модули и другое.

source: The <a href="@accounts">Account settings page</a> allows you to manage settings for the displayed name of the anonymous user role, personal contact forms, user registration, and account cancellation. On this page you can also manage settings for account personalization (including signatures and user pictures), and adapt the text for the e-mail messages that are sent automatically during the user registration process.
ru: Страница <a href="@accounts">настройки аккаунта</a> позволяет управлять его параметрами, такими как имя всех анонимных посетителей на сайте, персональная контактная форма, правила регистрации на сайте и удаления аккаунта. На этой странице можно также настроить параметры связанные с персонализацией пользователей, включая использование пользователями подписей и аватар, настроить текст писем, которые будут автоматически отправляться пользователям в процессе регистрации и других действий.

source: Permissions let you control what users can do and see on your site. You can define a specific set of permissions for each role. (See the <a href="@role">Roles</a> page to create a role). Two important roles to consider are Authenticated Users and Administrators. Any permissions granted to the Authenticated Users role will be given to any user who can log into your site. You can make any role the Administrator role for the site, meaning this will be granted all new permissions automatically. You can do this on the <a href="@settings">User Settings</a> page. You should be careful to ensure that only trusted users are given this access and level of control of your site.
ru: Права доступа позволяют управлять возможностями пользователей на сайте. Каждая <a href="@role">роль</a> имеет свой набор прав. Например, можно дать пользователям роли «зарегистрированный пользователь» право добавлять комментарии, а пользователям роли «анонимный посетитель» такого права не давать. Все права данные роли «зарегистрированный пользователь» распространяются на пользователей всех ролей, за исключением роли «анонимный посетитель». Для управления сайтом <a href="@settings">можно выбрать</a> роль, которой будут автоматически назначаться все возможные права.

source: Roles allow you to fine tune the security and administration of Drupal. A role defines a group of users that have certain privileges as defined on the <a href="@permissions">permissions page</a>. Examples of roles include: anonymous user, authenticated user, moderator, administrator and so on. In this area you will define the names and order of the roles on your site. It is recommended to order your roles from least permissive (anonymous user) to most permissive (administrator). To delete a role choose "edit role".
ru: Роли используются для группировки пользователей и передачи им определённых <a href="@permissions">прав</a>. Примеры ролей: «анонимный посетитель», «зарегистрированный пользователь», «администратор», «модератор», «редактор», «покупатель» и так далее. Для удаления роли, выберите ссылку «правка», напротив её названия.

source: By default, Drupal comes with two user roles:
ru: Стандартно, в Друпале есть две роли, которые являются системными и которые нельзя удалить:

source: Anonymous user: this role is used for users that don't have a user account or that are not authenticated.
ru: Анонимный посетитель (неидентифицированный пользователь): эта роль применяется ко всем пользователям которые не зарегистрированы на сайте, или не вошли в свой аккаунт

source: Authenticated user: this role is automatically granted to all logged in users.
ru: Зарегистрированный пользователь (идентифицированный пользователь): эта роль применяется ко всем вошедшим в свой аккаунт пользователям

source: This form lets administrators add, edit, and arrange fields for storing user data.
ru: Поля позволяют хранить различные типы данных о пользователях.

source: This form lets administrators configure how fields should be displayed when rendering a user profile page.
ru: Вывод данных позволяет настроить порядок, в котором они будут показываться, в тех или иных случаях.

source: User module timezone form element.
ru: Элемент модуля User

source: User module history view element.
ru: Элемент модуля User

source: Administer permissions
ru: Управление правами

source: View user profiles
ru: Просмотр профилей

source: Change own username
ru: Изменение своего логина

source: Cancel own user account
ru: Удаление своего аккаунта

source: Note: content may be kept, unpublished, deleted or transferred to the %anonymous-name user depending on the configured <a href="@user-settings-url">user settings</a>.
ru: При удалении пользователем аккаунта, все содержание добавленное на сайт из этого аккаунта может быть сохранено, депубликовано, удалено или передано в аккаунт «%anonymous-name». Применяемое действие зависит от параметров, выбранных на странице <a href="@user-settings-url">настройки аккаунта</a>.

source: Select method for cancelling own account
ru: Выбор способа удаления своего аккаунта

source: Spaces are allowed; punctuation is not allowed except for periods, hyphens, apostrophes, and underscores.
ru: Введите предпочитаемый логин (можно использовать псевдоним на русском языке). Логин не может начинаться и заканчиваться пробелом.

source: Enter your current password to change the %mail or %pass. !request_new.
ru: Ввод текущего пароля требуется для изменения почтового адреса или перехода на новых пароль. Если вы не помните свой пароль, то вы можете запросить его отправку на используемый в настоящее время почтовый адрес. !request_new.

source: Current password
ru: Пароль (текущий)

source: Your virtual face or picture. Pictures larger than @dimensions pixels will be scaled down.
ru: Ваша фотография или любое другое изображение, которое вы хотите использовать в качестве своего виртуального лица. Изображения, разрешение который превышает @dimensions пикселей, будут автоматически уменьшены.

source: The e-mail address %email is already taken.
ru: Адрес %email уже используется.

source: The signature is too long: it must be %max characters or less.
ru: Подпись слишком длинная. Подпись не может состоять более чем из %max знаков.

source: The user account %id does not exist.
ru: Аккаунта %id не существует.

source: Account details for [user:name] at [site:name]
ru: Регистрация на сайте «[site:name]»

source: [user:name], Thank you for registering at [site:name]. You may now log in by clicking this link or copying and pasting it to your browser: [user:one-time-login-url] This link can only be used once to log in and will lead you to a page where you can set your password. After setting your password, you will be able to log in at [site:login-url] in the future using: username: [user:name] password: Your password -- [site:name] team
ru: Зарегистрирован аккаунт на сайте «[site:name]». После входа в аккаунт измените пароль на тот, который вам удобен. Ссылка для входа в аккаунт: [user:one-time-login-url]

source: An administrator created an account for you at [site:name]
ru: Создание аккаунта на сайте «[site:name]»

source: [user:name], A site administrator at [site:name] has created an account for you. You may now log in by clicking this link or copying and pasting it to your browser: [user:one-time-login-url] This link can only be used once to log in and will lead you to a page where you can set your password. After setting your password, you will be able to log in at [site:login-url] in the future using: username: [user:name] password: Your password -- [site:name] team
ru: Администратором сайта «[site:name]» для вас создан аккаунт «[user:name]». — Ссылка для входа в аккаунт может использоваться только один раз. — После входа в аккаунт измените его пароль на тот, который вам удобен. — В дальнейшем, для входа в аккаунт можно пользоваться страницей [site:login-url]. Ссылка для входа: [user:one-time-login-url]

source: Account details for [user:name] at [site:name] (pending admin approval)
ru: Регистрация на сайте «[site:name]»

source: [user:name], Thank you for registering at [site:name]. Your application for an account is currently pending approval. Once it has been approved, you will receive another e-mail containing information about how to log in, set your password, and other details. -- [site:name] team
ru: Аккаунт «[user:name]» созданный на сайте «[site:name]» ожидает подтверждения администратора.

source: Replacement login information for [user:name] at [site:name]
ru: Восстановление аккаунта «[user:name]»

source: [user:name], A request to reset the password for your account has been made at [site:name]. You may now log in by clicking this link or copying and pasting it to your browser: [user:one-time-login-url] This link can only be used once to log in and will lead you to a page where you can set your password. It expires after one day and nothing will happen if it's not used. -- [site:name] team
ru: «[site:name]» Ссылка для входа в аккаунт (действительна в течение 24 часов): [user:one-time-login-url]

source: Account details for [user:name] at [site:name] (approved)
ru: Активирование аккаунта «[user:name]»

source: [user:name], Your account at [site:name] has been activated. You may now log in by clicking this link or copying and pasting it into your browser: [user:one-time-login-url] This link can only be used once to log in and will lead you to a page where you can set your password. After setting your password, you will be able to log in at [site:login-url] in the future using: username: [user:name] password: Your password -- [site:name] team
ru: Аккаунт «[user:name]» на сайте «[site:name]» активирован. — Ссылку для входа в аккаунт можно использовать только один раз. — После входа в аккаунт измените пароль на тот, который вам удобен. — В дальнейшем, для входа в аккаунт можно пользоваться страницей [site:login-url]. Ссылка для входа в аккаунт: [user:one-time-login-url].

source: Account details for [user:name] at [site:name] (blocked)
ru: Блокирование аккаунта «[user:name]»

source: [user:name], Your account on [site:name] has been blocked. -- [site:name] team
ru: Аккаунт «[user:name]» на сайте «[site:name]» блокирован.

source: Account cancellation request for [user:name] at [site:name]
ru: Удаление аккаунта «[user:name]»

source: [user:name], A request to cancel your account has been made at [site:name]. You may now cancel your account on [site:url-brief] by clicking this link or copying and pasting it into your browser: [user:cancel-url] NOTE: The cancellation of your account is not reversible. This link expires in one day and nothing will happen if it is not used. -- [site:name] team
ru: Для удаления аккаунта «[user:name]» на сайте «[site:name]» перейдите по ссылке «[user:cancel-url]».

source: Account details for [user:name] at [site:name] (canceled)
ru: Удаление аккаунта «[user:name]»

source: [user:name], Your account on [site:name] has been canceled. -- [site:name] team
ru: Аккаунт «[user:name]» на сайте «[site:name]» удалён.

source: Are you sure you want to cancel these user accounts?
ru: Удаление аккаунтов

source: Cancel accounts
ru: Удалить аккаунты

source: To make your password stronger:
ru: Улучшение надёжности пароля:

source: Make it at least 6 characters
ru: Используйте не менее 6 знаков

source: Add lowercase letters
ru: Используйте знаки в нижнем регистре

source: Add uppercase letters
ru: Используйте знаки в верхнем регистре

source: Add numbers
ru: Используйте цифры

source: Add punctuation
ru: Используйте пунктуацию

source: Make it different from your username
ru: Не используйте в качестве пароля логин

source: yes
ru: Да

source: no
ru: Нет

source: Weak
ru: Слабая

source: Good
ru: Хорошо

source: A welcome message with further instructions has been e-mailed to the new user <a href="@url">%name</a>.
ru: Дальнейшие инструкции пользователю «<a href="@url">%name</a>» отправлены.

source: A welcome message with further instructions has been sent to your e-mail address.
ru: Дальнейшие инструкции отправлены на указанный почтовый адрес.

source: Attempted to cancel non-existing user account: %id.
ru: Попытка выйти из несуществующего аккаунта %id.

source: Blocked user: %name %email.
ru: Пользователь «%name» (%email) блокирован.

source: There is currently 1 user online.
ru: 1 пользователь.

source: People
ru: Пользователи

source: Manage user accounts, roles, and permissions.
ru: Управление аккаунтами, ролями и правами пользователей.

source: Configure user accounts.
ru: Настройка аккаунтов.

source: Configure default behavior of users, including registration requirements, e-mails, fields, and user pictures.
ru: Настройка регистрации на сайте, содержание отправляемых писем, использование подписей и аватар.

source: administrator
ru: администратор

source: This permission is inherited from the authenticated user role.
ru: Это право наследуется от роли «Зарегистрированный пользователь».

source: Timezone
ru: Часовой пояс
